<?php

use yii\db\Migration;
use app\helpers\Common as CH;

class m200408_140212_create_products_table extends Migration
{
    public function safeUp()
    {
        $this->createTable('products', [
            'id' => $this->primaryKey()->unsigned(),
            'slug' => $this->string(),

            'name_ua' => $this->string(191),
            'name_ru' => $this->string(191),
            'title_ua' => $this->string(191),
            'title_ru' => $this->string(191),
            'keywords_ua' => $this->string(191),
            'keywords_ru' => $this->string(191),
            'description_ua' => $this->text(),
            'description_ru' => $this->text(),
            'text_ua' => $this->text(),
            'text_ru' => $this->text(),

            'price' => $this->decimal(8, 2)->unsigned(),
            'discount' => $this->decimal(8, 2)->unsigned()->comment('цена со скидкой'),
            'measure' => $this->decimal(8, 3)->unsigned()->comment('за сколько'),
            'unit_id' => $this->integer()->unsigned()->comment('в каких единицах'),
            'vendorcode' => $this->string()->comment('артикул'),
            'availability' => $this->integer()->unsigned()->comment('наличие'),
            'sequence' => $this->integer()->unsigned()->defaultValue(1)->comment('очередность в показе'),
            'status' => $this->integer()->unsigned()
                ->comment('0 - не показывать вовсе, 123 скоро выпуск, снят с производства, ожидается поставка...'),
            'recommended' => $this->tinyInteger()->unsigned(),

            'created_at' => $this->integer()->unsigned(),
            'updated_at' => $this->integer()->unsigned(),
        ]);

        $changes = ['slug', 'vendorcode'];
        foreach ($changes as $name) {
            $this->execute('ALTER TABLE `products` MODIFY `' . $name . '` varchar(255) CHARSET utf8 COLLATE utf8_unicode_ci');
        }

        $this->execute("ALTER TABLE `products` ADD KEY `str10-products-slug` (`slug`(10))");
        $this->createIndex('idx-products-price', 'products', 'price');
        $this->createIndex('idx-products-discount', 'products', 'discount');
        $this->createIndex('idx-products-status', 'products', 'status');
        $this->createIndex('idx-products-availability', 'products', 'availability');

        /*if (true) {
            $text = 'Еней був парубок моторний
І хлопець хоть куди козак,
Удавсь на всеє зле проворний,
Завзятіший од всіх бурлак.
Но греки, як спаливши Трою,
Зробили з неї скирту гною,
Він, взявши торбу, тягу дав;
Забравши деяких троянців,
Осмалених, як гиря, ланців,
П\'ятами з Трої накивав.
Він, швидко поробивши човни,
На синє море поспускав,
Троянців насажавши повні,
І куди очі почухрав.
Но зла Юнона, суча дочка,
Розкудкудакалась, як квочка, —
Енея не любила — страх;
Давно уже вона хотіла,
Його щоб душка полетіла
К чортам і щоб і дух не пах.
3 Еней був тяжко не по серцю
Юноні — все її гнівив;
Здававсь гірчійший їй від перцю,
Ні в чім Юнони не просив;
Но гірш за те їй не любився,
Що, бачиш, в Трої народився
І мамою Венеру звав;
І що його покійний дядько,
Парис, Пріамове дитятко,
Путивочку Венері дав.
Побачила Юнона з неба,
Що пан Еней на поромах;
А те шепнула сука Геба...
Юнону взяв великий жах!
Впрягла в гринджолята павичку,
Сховала під кибалку мичку,
Щоб не світилася коса;
Взяла спідницю і шнурівку,
І хліба з сіллю на тарілку,
К Еолу мчалась, як оса.
"Здоров, Еоле, пане-свату!
Ой, як ся маєш, як живеш? —
Сказала, як ввійшла у хату,
Юнона. — Чи гостей ти ждеш?.."
Поставила тарілку з хлібом
Перед старим Еолом-дідом,
Сама же сіла на ослін.
"Будь ласкав, сватоньку-старику!
Ізбий Енея з пантелику,
Тепер пливе на морі він.
Ти знаєш, він який суціга,
Паливода і горлоріз;
По світу як іще побіга,
Чиїхсь багацько виллє сліз.
Пошли на його лихо злеє,
Щоб люди всі, що при Енеї,
Послизли і щоб він і сам...
За сеє ж дівку чорнобриву,
Смачную, гарну, уродливу
Тобі я, далебі, що дам".
"Гай, гай! ой, дей же його кату!
Еол насупившись сказав. —
Я все б зробив за сюю плату,
Та вітри всі порозпускав:
Борей недуж лежить з похмілля,
А Нот поїхав на весілля,
Зефір же, давній негодяй,
З дівчатами заженихався,
А Евр в поденщики нанявся, —
Я к хочеш, так і помишляй!
Та вже для тебе обіщаюсь
Енеєві я ляпас дать;
Я хутко, миттю постараюсь
В трістя його к чортам загнать.
Прощай же! швидче убирайся,
Обіцянки не забувайся,
Бо послі, чуєш, нічичирк!
Я к збрешеш, то хоча надсядься,
На ласку послі не понадься,
Тогді від мене возьмеш чвирк".
Еол, оставшись на господі,
Зібрав всіх вітрів до двора,
Велів поганій буть погоді...
Якраз на морі і гора!
Все море зараз спузирило,
Водою мов в ключі забило,
Еней тут крикнув, як на пуп;
Заплакався і заридався,
Пошарпався, увесь подрався,
На тім\'ї начесав аж струп.
Прокляті вири роздулися,
А море з лиха аж реве;
Слізьми троянці облилися,
Енея за живіт бере;
Всі човники їх розчухрало,
Багацько війська тут пропало;
Тогді набрались всі сто лих!
Еней кричить, що "я Нептуну
Півкопи грошей в руку суну,
Аби на морі штурм утих".
Нептун іздавна був дряпічка,
Почув Енеїв голосок;
Шатнувся зараз із запічка,
Півкопи для його кусок!..
І миттю осідлавши рака,
Схвативсь на його, мов бурлака,
І вирнув з моря, як карась.
Загомонів на вітрів грізно:
"Чого ви гудете так різно?
До моря, знаєте, вам зась!"
От тут-то вітри схаменулись
І ну всі драла до нори;
До л я с а мов ляхи шатнулись,
Або од їжака тхори.
Нептун же зараз взяв мітелку
І вимів море, як світелку,
То сонце глянуло на світ.
Еней тогді як народився,
Разів із п\'ять перехрестився;
Звелів готовити обід.
Поклали шальовки соснові,
Кругом наставили мисок;
І страву всякую, без мови,
В голодний пхали все куток.
Тут з салом галушки лигали,
Лемішку і куліш глитали
І брагу кухликом тягли;
Та і горілочку хлистали, —
Насилу із-за столу встали
І спати послі всі лягли.
Венера, не послідня шльоха,
Проворна, враг її не взяв,
Побачила, що так полоха
Еол синка, що аж захляв;
Умилася, причепурилась
І, як в неділю, нарядилась,
Хоть би до дудки на танець!
Взяла очіпок грезетовий
І кунтуш з усами люстровий,
Пішла к Зевесу на ралець.
Зевес тогді кружав сивуху
І оселедцем заїдав;
Він, сьому випивши восьмуху,
Послідки з кварти виливав.
Прийшла Венера, іскривившись,
Заплакавши і завіскрившись,
І стала хлипать перед ним:
"Чим пред тобою, милий тату,
Син заслужив таку мій плату?
Ійон, мов в свинки, грають їм.
Куди йому уже до Риму?
Хіба як здохне чорт в рові!
Як вернеться пан хан до Криму,
Як жениться сич на сові.
Хіба б уже та не Юнона,
Щоб не вказала макогона,
Що й досі слухає чмелів!
Коли б вона та не бісилась,
Замовкла і не камезилась,
Щоб ти се сам їй ізвелів".
Юпитер, все допивши з кубка,
Погладив свій рукою чуб:
"Ох, доцю, ти моя голубка!
Я в правді твердий так, як дуб.
Еней збудує сильне царство
І заведе своє там панство;
Не малий буде він панок.
На панщину ввесь світ погонить,
Багацько хлопців там наплодить
І всім їм буде ватажок.
Заїде до Дидони в гості
І буде там бенькетовать;
Полюбиться її він мосці
І буде бісики пускать.
Іди, небого, не журися,
Попонеділкуй, помолися,
Все буде так, як я сказав".
Венера низько поклонилась
І з панотцем своїм простилась,
А він її поціловав.
Еней прочумався, проспався
І голодрабців позбирав,
Зо всім зібрався і уклався,
І, скілько видно, почухрав.
Плив-плив, плив-плив, що аж обридло,
І море так йому огидло,
Що бісом на його дививсь.
"Коли б, — каже, — умер я в Трої,
Уже б не пив сеї гіркої
І марне так не волочивсь".
Потім до берега приставши
З троянством голим всім своїм,
На землю з човнів повстававши,
Спитавсь, чи є що їсти їм?
І зараз чогось попоїли,
Щоб на путі не ослабіли;
Пішли, куди хто запопав.
Еней по берегу попхався,
І сам не знав, куди слонявся,
Аж гульк — і в город причвалав.
В тім городі жила Дидона,
А город звався Карфаген,
Розумна пані і моторна,
Для неї трохи сих імен:
Трудяща, дуже працьовита,
Весела, гарна, сановита,
Бідняжка — що була вдова;
По городу тогді гуляла,
Коли троянців повстрічала .
Такі сказала їм слова:
"Відкіль такі се гольтіпаки?
Чи рибу з Дону везете?
Чи, може, виходці-бурлаки?
Куди, прочане, ви йдете?
Який вас враг сюди направив?
І хто до города причалив?
Яка ж ватага розбишак!"
Троянці всі замурмотали,
Дидоні низько в ноги пали,
А вставши, їй мовляли так:
"Ми всі, як бач, народ хрещений,
Волочимся без талану,
Ми в Трої, знаєш, порождені,
Еней пустив на нас ману;
Дали нам греки прочухана
І самого Енея-пана
В три вирви вигнали відтіль;
Звелів покинути нам Трою,
Підмовив плавати з собою,
Тепер ти знаєш, ми відкіль.
Помилуй, пані благородна!
Не дай загинуть головам,
Будь милостива, будь незлобна,
Еней спасибі скаже сам.
Чи бачиш, як ми обідрались!
Убрання, постоли порвались,
Охляли, ніби в дощ щеня!
Кожухи, свити погубили
І з голоду в кулак трубили,
Така нам лучилась пеня".
Дидона гірко заридала
І з білого свого лиця
Платочком сльози обтирала:
"Коли б, — сказала, — молодця
Енея вашого злапала,
Уже б тогді весела стала,
Тогді Великдень був би нам!"
Тут плюсь — Еней, як будто з неба:
"Ось, осьде я, .коли вам треба!
Дидоні поклонюся сам".
Потім з Дидоною обнявшись,
Поціловались гарно всмак;
За рученьки біленькі взявшись,
Балакали то сяк, то так.
Пішли к Дидоні до господи
Через великі переходи,
Ввійшли в світлицю та й на піл;
Пили на радощах сивуху
І їли сім\'яну макуху,
Покіль кликнули їх за стіл.
Тут їли розниї потрави,
І все з полив\'яних мисок,
І самі гарниї приправи
З нових кленових тарілок:
Свинячу голову до хріну
І локшину на переміну,
Потім з підлевою індик;
На закуску куліш і кашу,
Лемішку, зубці, путрю, квашу
І з маком медовий шулик.
І кубками пили слив\'янку,
Мед, пиво, брагу, сирівець,
Горілку просту і калганку,
Куривсь для духу яловець.
Бандура горлиці бриньчала,
Сопілка зуба затинала,
А дудка грала по балках;
Санжарівки на скрипці грали,
Кругом дівчата танцьовали
В дробушках, в чоботах, в свитках.
Сестру Дидона мала Ганну,
Навсправжки дівку хоть куди,
Проворну, чепурну і гарну;
Приходила і ся сюди
В червоній юпочці баєвій,
В запасці гарній фаналевій,
В стьонжках, в намисті і ковтках;
Тут танцьовала викрутасом,
І пред Енеєм вихилясом
Під дудку била третяка.
Еней і сам так розходився,
Як на аркані жеребець,
Що трохи не увередився,
Пішовши з Гандзею в танець.
В обох підківки забряжчали,
Жижки од танців задрижали,
Вистрибовавши гоцака.
Еней, матню в кулак прибравши
І не до соли примовлявши,
Садив крутенько гайдука.
А послі танців варенухи
По филижанці піднесли;
І молодиці-цокотухи
Тут баляндраси понесли;
Дидона кріпко заюрила,
Горщок з вареною розбила,
До дуру всі тоді пили.
Ввесь день весело прогуляли
І п\'яні спати полягали;
Енея ж ледве повели.
Еней на піч забрався спати,
Зарився в просо, там і ліг;
А хто схотів, побрів до хати,
А хто в хлівець, а хто під стіг.
А деякі так так хлиснули,
Що де упали — там заснули,
Сопли, харчали і хропли;
А добрі молодці кружали,
Поки аж півні заспівали, —
Що здужали, то все тягли.
Дидона рано ісхопилась.
Пила з похмілля сирівець;
А послі гарно нарядилась,
Якби в оренду на танець.
Взяла кораблик бархатовий,
Спідницю і карсет шовковий
І начепила ланцюжок;
Червоні чоботи обула,
Та і запаски не забула,
А в руки з вибійки платок.
Еней же, з хмелю як проспався,
Із\'їв солоний огірок;
Потім умився і убрався,
Я к парубійка до дівок.
Йому Дидона підослала,
Що од покійника украла,
Штани і пару чобіток;
Сорочку і каптан з китайки,
І шапку, пояс з каламайки,
І чорний шовковий платок.
Я к одяглись, то ізійшлися,
З собою стали розмовлять;
Наїлися і принялися,
Щоб по-вчорашньому гулять.
Дидона ж тяжко сподобала
Енея так, що і не знала,
Де дітися і що робить;
Точила всякії баляси
І підпускала разні ляси,
Енею тілько б угодить.
Дидона вигадала грище,
Еней щоб веселіший був,
І шоб вертівся з нею ближче,
І лиха щоб свого забув:
Собі очиці зав\'язала
І у панаса грати стала,
Енея б тільки уловить;
Еней же зараз догадався,
Коло Дидони терся, м\'явся,
Її щоб тілько вдовольнить.
Тут всяку всячину іграли,
Хто як і в віщо захотів,
Тут инчі журавля скакали,
А хто од дудочки потів.
І в хрещика і в горю дуба,
Не раз доходило до чуба,
Як загулялися в джгута;
В хлюста, в пари, в візка іграли
І дамки по столу совали;
Чорт мав порожнього кута.
Щодень було у них похмілля,
Пилась горілка, як вода;
Щодень бенькети, мов весілля,
Всі п\'яні, хоть посуньсь куда.
Енеєві так, як болячці
Або лихій осінній трясці,
Годила пані всякий день.
Були троянці п\'яні, ситі,
Кругом обуті і обшиті,
Хоть голі прибрели, як пень.
Троянці добре там курили,
Дали приманку всім жінкам,
По вечорницям всі ходили,
Просвітку не було дівкам.
Та й сам Еней, сподар, і паню
Підмовив паритися в баню...
Уже ж було не без гріха!
Бо страх вона його любила,
Аж розум ввесь свій погубила,
А бачся, не була плоха.
От так Еней жив у Дидони,
Забув і в Рим щоб мандровать.
    Тут не боявся і Юнони,
Пустився все бенькетовать;
Дидону мав він мов за жінку,
Убивши добру в неї грінку,
Мутив, як на селі москаль!
    Бо — хрін його не взяв — моторний,
Ласкавий, гарний і проворний,
І гострий, як на бритві сталь.
Еней з Дидоною возились,
Я к з оселедцем сірий кіт;
Ганяли, бігали, казились,
Аж лився деколи і піт.
Дидона ж мала раз роботу,
Я к з ним побігла на охоту,
Та грім загнав їх в темний льох...
Лихий їх зна, що там робили,
Було не видно з-за могили,
В льоху ж сиділи тілько вдвох.
Не так-то робиться все хутко,
Я к швидко оком ізмигнеш;
Або як казку кажеш прудко,
Пером в папері як писнеш.
Еней в гостях прожив немало, —
Що з голови його пропало,
Куди його Зевес послав.
Він годів зо два там просидів,
А мабуть би, і більш пронидів,
Якби його враг не спіткав.
Колись Юпитер ненароком
З Олимпа глянув і на нас;
І кинув в Карфагену оком,
Аж там троянський мартопляс...
Розсердився і розкричався,
Аж цілий світ поколихався;
Енея лаяв на ввесь рот:
"Чи так-то, гадів син, він слуха?
Убрався в патоку, мов муха,
Засів, буцім в болоті чорт.

44 Підіть гінця мені кликніте,
До мене зараз щоб прийшов,
Глядіть же, цупко прикрутіте,
Щоб він в шиньок та не зайшов!
Бо хочу я кудись послати.
Ійон, ійон же, вража мати!
Але Еней наш зледащів
А то Венера все свашкує,
Енеєчка свого муштрує,
Щоб він з ума Дидону звів".
Прибіг Меркурій засапавшись,
В три ряди піт з його котив;
Ввесь ремінцями обв\'язавшись,
На голову бриль наложив;
На грудях з бляхою ладунка,
А ззаду з сухарями сумка,
В руках нагайський малахай.
В такім наряді влізши в хату,
Сказав: "Готов уже я, тату,
Куда ти хочеш, посилай".
"Біжи лиш швидче в Карфагену,-
Зевес гінцеві так сказав, —
І пару розлучи скажену,
Еней Дидону б забував.
Нехай лиш відтіль уплітає
І Рима строїти чухрає, —
А то заліг, мов в грубі пес.
Коли .ж він буде йще гуляти,
То дам йому себе я знати, —
От так сказав, скажи, Зевес".
Меркурій низько поклонився,
Перед Зевесом бриль ізняв,
Через поріг перевалився,
До стані швидче тягу дав.
Покинувши із рук нагайку,
Запряг він миттю чортопхайку,
Черкнув із неба, аж курить!
І все кобилок поганяє,
Що оглобельна аж брикає;
Помчали, аж візок скрипить!
Еней тогді купався в бразі
І на полу укрившись ліг;
Йому не снилось о приказі,
Як ось Меркурій в хату вбіг!
Смикнув із полу, мов псяюху.
"А що ти робиш, п\'єш сивуху? —
Зо всього горла закричав, —
Ану лиш, швидче убирайся,
З Дидоною не женихайся,
Зевес поход тобі сказав!
Чи се ж таки до діла робиш,
Що й досі тута загулявсь?
Та швидко і не так задробиш;
Зевес не дурно похвалявсь;
Получиш добру халазію,
Він видавить з тебе олію,
От тілько йще тут побарись.
Гляди ж, сьогодня щоб убрався,
Щоб нищечком відсіль укрався,
Мене удруге не дождись".
Еней піджав хвіст, мов собака;
Мов Каїн, затрусивсь увесь;
Із носа потекла кабака:
Уже він знав, який Зевес.
Шатнувся миттю сам із хати
Своїх троянців позбирати;
Зібравши, дав такий приказ:
"Як можна швидче укладайтесь,
Зо всіми клунками збирайтесь,
До моря швендайте якраз!"
А сам, вернувшися в будинки,
Своє лахміття позбирав;
Мізерії наклав дві скриньки,
На човен зараз одіслав
І дожидався тілько ночі,
Що як Дидона зімкне очі,
Щоб не прощавшись тягу дать.
Хоть він за нею і журився
І світом цілий день нудився;
Та ба! бач, треба покидать.
Дидона зараз одгадала,
Чого сумує пан Еней,
І все на ус собі мотала,
Щоб умудритися і їй;
З-за печі часто виглядала,
Прикинувшись, буцім куняла
І мов вона хотіла спать.
Еней же думав, що вже спала,
І тілько що хотів дать драла,
Аж ось Дидона за чуб хвать.
"Постій, прескурвий, вражий сину!
Зо мною перше розплатись;
От задушу, як злу личину!
Ось ну лиш тільки завертись!
От так за хліб, за сіль ти платиш?
Ти всім, привикши насміхатись,
Розпустиш славу по мені!
Нагріла в пазусі гадюку,
Що послі ізробила муку;
Послала пуховик свині.
Згадай, який прийшов до мене,
Що ні сорочки не було;
І постолів чорт мав у тебе,
В кишені ж пусто, аж гуло;
Чи знав ти, що такеє гроші?
Мав без матні одні холоші,
І тілько слава, що в штанах;
Та й те порвалось і побилось,
Аж глянуть сором, так світилось;
Свитина вся була в латках.
Чи я ж тобі та не годила?
Хіба ріжна ти захотів?
Десь вража мати підкусила,
Щоб хирний тут ти не сидів".
Дидона гірко заридала,
І з серця аж волосся рвала,
І закраснілася, мов рак.
Запінилась, посатаніла,
Неначе дурману із\'їла,
Залаяла Енея так:
"Поганий, мерзький, скверний, бридкий,
Нікчемний, ланець, кателик!
Гульвіса, пакосний, престидкий,
Негідний, злодій, єретик!
За кучму сю твою велику
Як дам ляща тобі я в пику,
То тут тебе лизне і чорт!
І очі видеру із лоба
Тобі, диявольська худоба,
Трясешся, мов зимою хорт!
Мандруй до сатани з рогами,
Нехай тобі присниться біс!
З твоїми сучими синами,
Щоб враг побрав вас всіх гульвіс,
Що ні горіли, ні боліли,
На чистому щоб поколіли,
Щоб не оставсь ні чоловік;
Щоб доброї не знали долі,
Були щоб з вами злиї болі,
Щоб ви шаталися повік".
Еней від неї одступався,
Поки зайшов через поріг,
А далі аж не оглядався,
З двора в собачу ристь побіг.
Прибіг к троянцям, засапався,
Обмок в поту, якби купався,
Мов з торгу в школу курохват;
Потім в човен хутенько сівши
І їхати своїм велівши,
Не оглядався сам назад.
Дидона тяжко зажурилась,
Ввесь день ні їла, ні пила;
Все тосковала, все нудилась,
Кричала, плакала, ревла.
То бігала, якби шалена,
Стояла довго тороплена,
Кусала ногті на руках;
А далі сіла на порозі,
Аж занудило їй, небозі,
І не встояла на ногах.
Сестру кликнула на пораду,
Щоб горе злеє розказать,
Енеєву оплакать зраду
І льготи серцю трохи дать.
"Ганнусю, рибко, душко, любко,
Рятуй мене, моя голубко,
Тепер пропала я навік!
Енеєм кинута я бідна,
Як сама паплюга послідня,
Еней злий змій — не чоловік!
Нема у серця мого сили,
Щоб я могла його забуть.
Куди мні бігти? — до могили!
Туди один надежний путь!
Я все для його потеряла,
Людей і славу занедбала;
Боги! я з ним забула вас.
Ох! дайте зілля мні напитись,
Щоб серцю можна розлюбитись,
Утихомиритись на час.
Нема на світі мні покою,
Не ллються сльози із очей,
Для мене білий світ єсть тьмою,
Там ясно тілько, де Еней.
О пуцьверинку Купидоне!
Любуйся, як Дидона стогне...
Щоб ти маленьким був пропав!
Познайте, молодиці гожі,
З Енеєм бахурі всі схожі,
Щоб враг зрадливих всіх побрав!"
Так бідна з горя говорила
Дидона, жизнь свою кляла;
І Ганна що їй ні робила,
Ніякой ради не дала.
Сама з царицей горювала,
І сльози рукавом втирала,
І хлипала собі в кулак.
Потім Дидона мов унишкла,
Звеліла, щоб і Гандзя вийшла,
Щоб їй насумоватись всмак.
Довгенько так посумовавши,
Пішла в будинки на постіль;
Подумавши там, погадавши,
Проворно скочила на піл.
І взявши з запічка кресало
І клоччя в пазуху чимало,
Тихенько вийшла на город.
Ночною се було добою
І самой тихою порою,
Як спав хрещений ввесь народ.
Стояв у неї на городі
В кострі на зиму очерет;
Хоть се не по царській породі,
Та де ж взять дров, коли все степ;
В кострі був зложений сухенький,
Як порох, був уже палкенький,
Його й держали на підпал.
Під ним вона огонь кресала
І в клоччі гарно розмахала
І розвела пожар чимал.
Кругом костер той запаливши,
Зо всей одежі роздяглась,
В огонь лахміття все зложивши,
Сама в огні тім простяглась.
Вкруг неї полом\'я палало,
Покійниці не видно стало,
Пішов од неї дим і чад! —
Енея так вона любила,
Що аж сама себе спалила,
Послала душу к чорту в ад.
Еней, попливши синім морем,
На Карфагену оглядавсь;
Боровсь з своїм, сердега, горем,
Слізьми, бідняжка, обливавсь.
Хоть од Дидони плив поспішно,
Та плакав гірко, неутішно.
Почувши ж., що в огні спеклась,
Сказав: "Нехай їй вічне царство,
Мені же довголітнє панство,
І щоб друга вдова найшлась!"
Як ось і море стало грати,
Великі хвилі піднялись,
І вітри зачали бурхати,
Аж човни на морі тряслись.
Водою чортзна-як крутило,
Що трохи всіх не потопило,
Вертілись човни, мов дурні.
Троянці з страху задрижали,
І що робити, всі не знали,
Стояли мовчки всі смутні.
Один з троянської ватаги,
По їх він звався Палінур;
Сей більше мав других одваги,
Сміленький був і балагур;
Що наперед сей схаменувся
І до Нептуна окликнувся:
"А що ти робиш, пан Нептун!
Чи се і ти пустивсь в ледащо,
Що хочеш нас звести нінащо?
Хіба півкопи і забув?"
А далі після сеї мови
Троянцям він так всім сказав:
"Бувайте, братця, ви здорові!
Оце Нептун замудровав.
Куди тепер ми, братця, пійдем?
В Італію ми не доїдем,
Бо море дуже щось шпує,
Італія відсіль не близько,
А морем в бурю їхать слизько,
Човнів ніхто не підкує.
Ось тут земелька єсть, хлоп\'ята,
Відсіль вона невдалеку:
Сицилія, земля багата,
Вона мені щось по знаку.
Дмухнім лиш, братця, ми до неї
Збувати горесті своєї,
Там добрий цар живе Ацест.
Ми там, як дома, очуняєм,
І як у себе, загуляєм,
Всього у нього вдоволь єсть".
Троянці разом принялися
І стали веслами гребти,
Як стрілки, човники неслися,
Мов ззаду пхали їх чорти.
Їх сицилійці як уздріли,
То з .города, мов подуріли,
До моря бігли всі встрічать.
Тут між собою розпитались,
Чоломкались і обнімались,
Пішли до короля гулять.
Ацест Енею, як би брату,
Велику ласку показав,
І, зараз попросивши в хату,
Горілкою почастовав;
На закуску наклали сала,
Лежала ковбаса чимала
І хліба повне решето.
Троянцям всім дали тетері
І відпустили на кватері:
Щоб йшли, куди потрапить хто.
Тут зараз підняли банькети
Замурмотали, як коти,
І в кахлях понесли пашкети,
І киселю їм до сити;
Гарячую, м\'яку бухинку,
Зразову до рижків печінку,
Гречаний з часником панпух.
Еней з дороги налигався
І пінної так нахлестався,
Трохи не виперсь з його дух.
Еней хоть трохи був підпилий,
Та з розумом не потерявсь;
Він син був богобоязливий,
По смерти батька не цуравсь.
В сей день його отець опрягся,
Як чикилдихи обіжрався, —
Анхиз з горілочки умер.
Еней схотів обід справляти
І тут старців нагодовати, —
Щоб біг душі свій рай одпер.
Зібрав троянську всю громаду
І сам пішов надвір до них,
Просить у їх собі пораду,
Сказав їм річ в словах таких:
"Панове, знаєте, трояне
І всі хрещенії миряне,
Що мій отець бував Анхиз,
Його сивуха запалила
І живота укоротила,
І він, як муха в зиму, зслиз.
"Зробити поминки я хочу,
Поставити обід старцям —
І завтра ж — далі не одстрочу.
Скажіте: як здається вам?"
Сього троянці і бажали,
І всі уголос закричали:
"Енею, боже поможи;
Коли же хочеш, пане, знати,
І сами будем помагати,
Бо ми тобі не вороги".
І зараз миттю всі пустились
Горілку, м\'ясо куповать,
Хліб, бублики, книші вродились,
Пійшли посуди добувать;
І коливо з куті зробили,
Сити із меду наситили,
Договорили і попа;
Хазяїнів своїх ззивали,
Старців по улицям шукали,
Пішла на дзвін дякам копа.
На другий день раненько встали,
Огонь надворі розвели
І м\'яса в казани наклали,
Варили страву і пекли.
П\'ять казанів стояло юшки,
А в чотирьох були галушки,
Борщу трохи було не з шість;
Баранів тьма була варених,
Курей, гусей, качок печених,
Досита щоб було всім їсть.
Цебри сивушки там стояли
І браги повнії діжки;
Всю страву в вагани вливали
І роздавали всім ложки.
Як проспівали "со святими",
Еней обливсь слізьми гіркими,
І принялися всі трепать;
Наїлися і нахлистались,
Що деякі аж повалялись...
Тогді і годі поминать.
Еней і сам со старшиною
Анхиза добре поминав;
Не здрів нічого пред собою,
А ще з-за столу не вставав;
А далі трошки проходився,
Прочумався, протверезився,
Пішов к народу, хоть поблід.
З кишені вийнявши півкіпки,
Шпурнув в народ дрібних, як ріпки,
Щоб тямили його обід.
Енея заболіли ноги,
Не чув ні рук, ні голови;
Напали з хмелю перелоги,
Опухли очі, як в сови,
І весь обдувся, як барило,
Було на світі все немило,
Мисліте по землі писав.
З нудьги охляв і ізнемігся,
В одежі ліг і не роздігся,
Під лавкою до світа спав.
Прокинувшися, ввесь трусився,
За серце ссало, мов глисти;
Перевертався і нудився,
Не здужав голови звести,
Поки не випив півквартівки
З імбером пінної горілки
І кухля сирівцю не втер.
З-під лавки виліз і струхнувся,
Закашляв, чхнув і стрепенувся:
"Давайте, — крикнув, — пить тепер".
Зібравшися, всі паненята
Ізнов кружати начали,
Пили, як брагу поросята,
Горілку так вони тягли;
Тягли тут пінненьку троянці,
Не вомпили сициліанці,
Черкали добре назахват.
Хто пив тут більш од всіх сивухи,
І хто пив разом три осьмухи,
То той Енеєві був брат.
Еней наш роздоброхотався,
Ігрища вздумав завести,
І п\'яний зараз розкричався,
Щоб перебійців привести.
У вікон школярі співали,
Халяндри циганки скакали,
Іграли в кобзи і сліпці;
Були тут разні чути крики,
Водили в городі музики
Моторні, п\'яні молодці.
В присінках всі пани сиділи,
Надворі ж вкруг стояв народ.
У вікна деякі гляділи,
А инчий був наверх ворот;
Аж ось прийшов і перебієць,
Убраний так, як компанієць,
І звався молодець Дарес;
На кулаки став викликати
І перебійця визивати,
Кричав, опарений мов пес:
"Гей, хто зо мною вийде битись,
Покуштовати стусанів?
Мазкою хоче хто умитись?
Кому не жаль своїх зубів?
А нуте, нуте, йдіте швидше
Сюди на кулаки лиш ближче!
Я бебехів вам надсажу;
На очі вставлю окуляри,
Сюди, поганці-бакаляри!
Я всякому лоб розміжжу".
Дарес довгенько дожидався,
Мовчали всі, ніхто не йшов;
З ним всякий битися боявся,
Собою страху він задав.
"Так ви, бачу, всі легкодухи,
Передо мною так, як мухи,
І пудофети наголо".
Дарес тут дуже насміхався,
Собою чванивсь, величався,
Аж сором слухать всім було.
Абсест троянець був сердитий,
Згадав Ентелла-козака,
Зробився мов несамовитий,
Чимдуж дав відтіль дропака.
Ентелла скрізь пішов шукати,
Щоб все, що бачив, розказати
І щоб Дареса підцьковать.
Ентелл був тяжко смілий, дужий,
Мужик плечистий і невклюжий,
Тогді він п\'яний вклався спать.
Знайшли Ентелла-сіромаху,
Що він під тином гарно спав;
Сього сердешного тімаху
Будити стали, щоб устав.
Всі голосно над ним кричали,
Ногами всилу розкачали,
Очима він на них лупнув:
"Чого ви? що за вража мати,
Зібрались не давати спати".
Сказавши се, оп\'ять заснув.
"Та встань, будь ласкав, пане-свату!"
Абсест Ентеллові сказав.
"Пійдіть лиш ви собі ік кату!" —
Ентелл на їх так закричав.
А послі баче, що не шутка,
Абсест сказав, яка погудка,
Проворно скочивши, здригнувсь:
"Хто, як, Дарес? — ну, стійте наші!
Зварю пану Даресу каші,
Горілки дайте лиш нап\'юсь".
Примчали з казанок сивухи,
Ентелл її разком дмухнув
І од сієї він мокрухи
Скрививсь, наморщивсь і зівнув,
Сказав: "Тепер ходімо, братця,
До хвастуна Дареса-ланця!
Йому я ребра полічу,
Зімну всього я на кабаку,
На смерть зувічу, мов собаку,
Як битися — я научу!"
Прийшов Ентелл перед Дареса,
Сказав йому на сміх: "Гай-гай!
Ховайсь, проклята неотеса,
Зарання відсіль утікай;
Я роздавлю тебе, як жабу,
Зітру, зімну, мороз як бабу,
Що тут і зуби ти зітнеш.
Тебе диявол не пізнає,
З кістками чорт тебе злигає,
Уже від мене не влизнеш".
На землю шапку положивши,
По локоть руки засукав
І цупко кулаки стуливши,
Дареса битись визивав.
Із серця скриготав зубами,
Об землю тупотав ногами,
І на Дареса налізав.
Дарес не рад своїй лихоті,
Ентелл потяг не по охоті
Дареса, щоб його він знав.
В се врем\'я в рай боги зібрались
К Зевесу в гості на обід,
Пили там, їли, забавлялись,
Забули наших людських бід.
Там лакомини різні їли,
Буханчики пшеничні білі,
Кислиці, ягоди, коржі
І всякі-разні витребеньки, —
Уже либонь були п\'яненькі,
Понадувались, мов йоржі.
Я к ось знічев\'я вбіг Меркурій,
Засапавшися до богів;
Прискочив, мов котище мурий
До сирних в маслі пирогів!
"Ге! Ге! от тут-то загулялись,
Що і од світу одцурались,
Диявол-ма вам і стида.
В Сицилії таке твориться,
Що вам би треба подивиться, —
Там крик, мов підступа орда".
Боги, почувши, зашатались,
Із неба виткнули носи,
Дивитись на бійців хватались,
Як жаби літом із роси.
Ентелл там сильно храбровався,
Аж до сорочки ввесь роздягся,
Совав Даресу в ніс кулак.
Дарес ізвомпив сіромаха,
Бо був Ентелл непевна птаха,
Як чорноморський злий козак.
Венеру за виски хватило,
Як глянула, що там Дарес;
Ій дуже се було не мило,
Сказала: "Батечку Зевес!
Дай моєму Даресу сили,
Йому хвоста щоб не вкрутили,
Щоб він Ентелла поборов.
Мене тогді ввесь світ забуде,
Коли Дарес живий не буде;
Зроби, щоб був Дарес здоров".
Тут Бахус п\'яний обізвався,
Венеру лаяти почав,
До неї з кулаком совався,
І так ісп\'яна їй сказав:
"Пійди лиш ти к чортам, плюгава,
Невірна, пакосна, халява!
Нехай ізслизне твій Дарес,
Я за Ентелла сам вступлюся,
Як більш сивухи натягнуся,
То не заступить і Зевес.
Чи знаєш, він який парнище?
На світі трохи єсть таких,
Сивуху так, як брагу, хлище,
Я в парубках кохаюсь сих.
Уже заллє за шкуру сала,
Ні неня в бразі не скупала,
Як він Даресові задасть.
Уже хоть як ти не вертися,
З своїм Даресом попростися,
Бо прийдеться йому пропасть".
Зевес до речі сей дочувся,
Язик на силу повернув,
Він од горілки весь обдувся
І грімко так на їх гукнув:
\'Мовчіть!..';


        $parts = explode("\n", $text);

        $names = [];
        $slugs = [];
        foreach ($parts as $part) {
            $name = trim($part);
            $slug = CH::toSlug($name);
            if ($name && !in_array($name, $names) && !in_array($slug, $slugs)) {
                $names[] = $name;
                $slugs[] = $slug;
            }
        }
        $rows = [];
        for ($i = 0; $i < count($names) - 5; $i++) {
            $rows[] = [
                'name' => $names[$i],
                'text' => $names[$i] . ' ' . $names[$i + 1] . ' ' . $names[$i + 2] . ' ' . $names[$i + 3] . ' ' . $names[$i + 4]
            ];
        }
        $rows2 = [];
        foreach ($rows as $row) {
            $price = mt_rand(50, 500);
            $discount = (mt_rand(1, 10) > 8) ? ($price - mt_rand(30, $price)) : NULL;
            $rand = (mt_rand(1, 10) > 4);
            $measure = $rand ? mt_rand(50, 500) : NULL;
            $unit_id = $rand ? (mt_rand(1, 7)) : NULL;
            $availability = (mt_rand(1, 10) > 1) ? 1 : NULL;
            $recommended = (mt_rand(1, 10) > 9) ? 1 : 0;
            $rand = (mt_rand(1, 10) > 9);
            $status = $rand ? mt_rand(2, 5) : 1;
            $rows2[] = [CH::toSlug($row['name']), $row['name'], $row['name'], $row['name'], $row['name'], $row['name'],
                $row['name'], $row['text'], $row['text'], $row['text'], $row['text'],
                $price, $discount, $measure, $unit_id, $availability, $recommended, $status, time()];
        }

        $this->batchInsert('products', ['slug', 'name_ua', 'name_ru', 'title_ua', 'title_ru', 'keywords_ua', 'keywords_ru',
            'description_ua', 'description_ru', 'text_ua', 'text_ru', 'price', 'discount', 'measure', 'unit_id', 'availability',
            'recommended', 'status', 'created_at'],
            $rows2
        );
    }*/

        $data = [

            // 2
            ['Кокосова паста 190г', 'Кокосовая паста 190г', 130, 0, 190, 1, 1,
                '',
                '<h1>Кокосовая паста</h1>
<p>Мы очень трепетно относимся к выбору поставщиков и качеству продуктов. Каждая баночка прошла не маленький пусть до того как оказаться в ваших ручках. Мы долго и внимательно подбирали пропорции и ингредиенты, чтобы получить «ту самую» пасту.

И главными нашими двигателями, как не странно, были это натуральность и вкус. Сейчас мы 100% гордимся нашим продуктом и очень рады, что вы разделяете нашу любовь к здоровому питанию. Спасибо за то, что вы с нами!</p>'],
            ['Кокосова паста 300г', 'Кокосовая паста 300г', 170, 0, 300, 1, 2,
                '',
                '<h1>Кокосовая паста</h1>
<p>Мы очень трепетно относимся к выбору поставщиков и качеству продуктов. Каждая баночка прошла не маленький пусть до того как оказаться в ваших ручках. Мы долго и внимательно подбирали пропорции и ингредиенты, чтобы получить «ту самую» пасту.

И главными нашими двигателями, как не странно, были это натуральность и вкус. Сейчас мы 100% гордимся нашим продуктом и очень рады, что вы разделяете нашу любовь к здоровому питанию. Спасибо за то, что вы с нами!</p>'],
            ['Міндальна паста 190г', 'Миндальная паста 190г', 180, 0, 190, 1, 3,
                '',
                '<h1>Миндальная паста</h1>
<p>Миндальная паста по-настоящему особенная. В ней высокое содержания протеина и полезных жирных кислот, что делает перекус более насыщенным и полезным. Никаких сомнений о вкусе, ведь помимо своей полезности, миндальная паста очень-очень вкусная. Её полюбите не только вы, но и ваши близкие, друзья, знакомые.

Запасайтесь снэками, пастой и за стол пить ароматный чай.</p>'],
            ['Міндальна паста 300г', 'Миндальная паста 300г', 260, 0, 300, 1, 4,
                '',
                '<h1>Миндальная паста</h1>
<p>Миндальная паста по-настоящему особенная. В ней высокое содержания протеина и полезных жирных кислот, что делает перекус более насыщенным и полезным. Никаких сомнений о вкусе, ведь помимо своей полезности, миндальная паста очень-очень вкусная. Её полюбите не только вы, но и ваши близкие, друзья, знакомые.

Запасайтесь снэками, пастой и за стол пить ароматный чай.</p>'],
            ['Фундучна паста 190г', 'Фундучная паста 190г', 180, 0, 190, 1, 5,
                '',
                '<h1>Фундучная паста</h1>
<p>Фундучная паста имеет полужидкую консистенцию и в точности передаёт аромат и вкус этого ореха, потому что кроме фундука в составе больше ничего нет.

С чем есть фундучную пасту?

С фруктами, намазывать на хлебец или тост, добавлять в кашу, мюсли, протеиновый шейк, смузи, использовать для приготовления десертов, выпечки. Просто кушать большой ложкой!</p>'],
            ['Фундучна паста 300г', 'Фундучная паста 300г', 160, 0, 300, 1, 6,
                '',
                '<h1>Фундучная паста</h1>
<p>Фундучная паста имеет полужидкую консистенцию и в точности передаёт аромат и вкус этого ореха, потому что кроме фундука в составе больше ничего нет.

С чем есть фундучную пасту?

С фруктами, намазывать на хлебец или тост, добавлять в кашу, мюсли, протеиновый шейк, смузи, использовать для приготовления десертов, выпечки. Просто кушать большой ложкой!</p>'],
            ['Кешью паста 190г', 'Кешью паста 190г', 210, 0, 190, 1, 7,
                '',
                '<h1>Кешью паста</h1>
<p>А вы знали, что кешью паста это незаменимый маст-хэв в рационе здорового питания?

Только подумайте, она улучшает состояние кровеносных сосудов, пищеварительную систему, активирует работу мозга и укрепляет иммунитет!

В составе пасты только орешки кешью и гималайская соль. 100% натуральная и без каких либо добавок, что делает её максимально полезной, то что нужно в наше время!

Приятного аппетита и будьте здоровы!</p>'],
            ['Кешью паста 300г', 'Кешью паста 300г', 310, 0, 300, 1, 8,
                '',
                '<h1>Кешью паста</h1>
<p>А вы знали, что кешью паста это незаменимый маст-хэв в рационе здорового питания?

Только подумайте, она улучшает состояние кровеносных сосудов, пищеварительную систему, активирует работу мозга и укрепляет иммунитет!

В составе пасты только орешки кешью и гималайская соль. 100% натуральная и без каких либо добавок, что делает её максимально полезной, то что нужно в наше время!

Приятного аппетита и будьте здоровы!</p>'],
            ['Урбеч з розторопші 190г', 'Урбеч из расторопши 190г', 130, 0, 190, 1, 9,
                '',
                '<h1>Урбеч из семян расторопши</h1><p>Состав: перетертые в пасту сырые семена расторопши- 80% и сырые семена подсолнечника - 20%.

Срок хранения 180 дней.

Чем полезна расторопша?

1. Защита и поддержка печени.

Чаще всего расторопша известна именно благодаря своим гепатопротекторным свойствам. Она регулярно используется в комплексной терапии людьми, имеющими заболевания печени по разным причинам, включая алкогольную зависимость. К таким заболеваниям можно отнести ожирение и рак печени, а также гепатит.

2. Расторопша понижает уровень сахара в крови у диабетиков.

3. Иммунная система
Расторопша славится своим действием - стимулировать иммунную систему и укреплять защиту организма.

Расторопша – известное ранозаживляющее средство, ее также используют для лечения кожных и аллергических заболеваний. Расторопша полезна для женского здоровья. Кроме того, она предотвращает преждевременное старение и способствует активному похудению.</p>'],
            ['Урбеч з розторопші 300г', 'Урбеч из расторопши 300г', 170, 0, 300, 1, 10,
                '',
                '<h1>Урбеч из семян расторопши</h1><p>Состав: перетертые в пасту сырые семена расторопши- 80% и сырые семена подсолнечника - 20%.

Срок хранения 180 дней.

Чем полезна расторопша?

1. Защита и поддержка печени.

Чаще всего расторопша известна именно благодаря своим гепатопротекторным свойствам. Она регулярно используется в комплексной терапии людьми, имеющими заболевания печени по разным причинам, включая алкогольную зависимость. К таким заболеваниям можно отнести ожирение и рак печени, а также гепатит.

2. Расторопша понижает уровень сахара в крови у диабетиков.

3. Иммунная система
Расторопша славится своим действием - стимулировать иммунную систему и укреплять защиту организма.

Расторопша – известное ранозаживляющее средство, ее также используют для лечения кожных и аллергических заболеваний. Расторопша полезна для женского здоровья. Кроме того, она предотвращает преждевременное старение и способствует активному похудению.</p>'],
            ['Урбеч з золотистого льону 190г', 'Урбеч из золотистого льна 190г', 130, 0, 190, 1, 11,
                '',
                '<h1>Урбеч из золотистого льна</h1>
<p>Нет ничего лучше чем начать свой день правильно! Для этого мы предлагаем к вашему вниманию урбеч из семян золотого льна. Только представьте свой прекрасный утренний ритуал в компании травяного чая, свежего гречневого хлеба и вкуснейшего урбеча. Завтрак непременно станет вашим любимым приёмом пищи!

Вкусных завтраков вам!</p>'],
            ['Урбеч з золотистого льону 300г', 'Урбеч из золотистого льна 300г', 170, 0, 300, 1, 12,
                '',
                '<h1>Урбеч из золотистого льна</h1>
<p>Нет ничего лучше чем начать свой день правильно! Для этого мы предлагаем к вашему вниманию урбеч из семян золотого льна. Только представьте свой прекрасный утренний ритуал в компании травяного чая, свежего гречневого хлеба и вкуснейшего урбеча. Завтрак непременно станет вашим любимым приёмом пищи!

Вкусных завтраков вам!</p>'],
            ['Урбеч з чорного кмину 190г', 'Урбеч из черного тмина 190г', 180, 0, 190, 1, 13,
                '',
                '<h1>Что такое иммунитет и чем полезен чёрный тмин?</h1>
<p>Иммунитет – это невосприимчивость к какому-нибудь инфекционному заболеванию. Образно говоря, иммунитет – это пограничные войска нашего организма, которые днем и ночью стоят на страже, защищая нашу внутреннюю среду от всего вредного. Если наши пограничные войска ослаблены, организм не способен противостоять агрессии извне, и мы начинаем болеть.

Что снижает наш иммунитет? Существует множество причин возникновения иммунодефицита: больная печень и почки, авитаминоз, неправильное питание, постоянные стрессы, загрязнение окружающей среды.

Первые признаки снижения иммунной активности – быстрая утомляемость, хроническая усталость, сонливость или, наоборот, бессонница, головная боль, беспричинная раздражительность или, напротив, апатия, ломота в мышцах и суставах, общие ощущения дискомфорта.

Если вы заметили у себя, хотя бы 2 из вышеназванных симптомов, начинайте принимать черный тмин!

Чёрный тмин оказывает стимулирующее воздействие на вилочковую железу, отвечающую за иммунитет, тем самым уменьшая риск возникновения болезней.

Активным компонентом черного тмина является тимохинон. Повышающий выживаемость и деятельность других ключевых клеток в иммунной реакции на инфекцию или рак, а именно CD-8 Т-клеток.  Эти клетки являются «войском», которое активно выслеживает и убивает зараженные или раковые клетки после активации Т-хелперов и макрофагов. Эта работа, известная как «кондиционирование», усиливает эффективность этих жизненно важных клеток иммунной системы против рака и инфекционных заболеваний.

Урбеч из чёрного тмина скорее не лакомство, а лекарство. Принимать по столовой ложке в день и запивать БОЛЬШИМ количеством воды.

Пророк Магомет говорил, что «в черном тмине исцеление от всех болезней, кроме смерти». Но черный тмин не только целитель. Он прекрасно действует в составе косметических средств, помогает ухаживать за кожей лица и тела, руками, волосами. Ну и, конечно же, это прекрасная пряность, без которой многие блюда теряют всю свою прелесть.</p>'],
            ['Урбеч з чорного кмину 300г', 'Урбеч из черного тмина 300г', 260, 0, 300, 1, 14,
                '',
                '<h1>Что такое иммунитет и чем полезен чёрный тмин?</h1>
<p>Иммунитет – это невосприимчивость к какому-нибудь инфекционному заболеванию. Образно говоря, иммунитет – это пограничные войска нашего организма, которые днем и ночью стоят на страже, защищая нашу внутреннюю среду от всего вредного. Если наши пограничные войска ослаблены, организм не способен противостоять агрессии извне, и мы начинаем болеть.

Что снижает наш иммунитет? Существует множество причин возникновения иммунодефицита: больная печень и почки, авитаминоз, неправильное питание, постоянные стрессы, загрязнение окружающей среды.

Первые признаки снижения иммунной активности – быстрая утомляемость, хроническая усталость, сонливость или, наоборот, бессонница, головная боль, беспричинная раздражительность или, напротив, апатия, ломота в мышцах и суставах, общие ощущения дискомфорта.

Если вы заметили у себя, хотя бы 2 из вышеназванных симптомов, начинайте принимать черный тмин!

Чёрный тмин оказывает стимулирующее воздействие на вилочковую железу, отвечающую за иммунитет, тем самым уменьшая риск возникновения болезней.

Активным компонентом черного тмина является тимохинон. Повышающий выживаемость и деятельность других ключевых клеток в иммунной реакции на инфекцию или рак, а именно CD-8 Т-клеток.  Эти клетки являются «войском», которое активно выслеживает и убивает зараженные или раковые клетки после активации Т-хелперов и макрофагов. Эта работа, известная как «кондиционирование», усиливает эффективность этих жизненно важных клеток иммунной системы против рака и инфекционных заболеваний.

Урбеч из чёрного тмина скорее не лакомство, а лекарство. Принимать по столовой ложке в день и запивать БОЛЬШИМ количеством воды.

Пророк Магомет говорил, что «в черном тмине исцеление от всех болезней, кроме смерти». Но черный тмин не только целитель. Он прекрасно действует в составе косметических средств, помогает ухаживать за кожей лица и тела, руками, волосами. Ну и, конечно же, это прекрасная пряность, без которой многие блюда теряют всю свою прелесть.</p>'],
            ['Урбеч з гарбузового насіння 190г', 'Урбеч из тыквенных семечек 190г', 130, 0, 190, 1, 15,
                '',
                '<h1>Урбеч из тыквенных семечек</h1>
<p>Хотим поделится с вами нашим любимым тыквенным урбечем. За окном коронавирус, а значит такая баночка точно должна быть у вас в холодильнике. Дело в том, что тыквенные семечки богаты цинком. А как мы помним, цинк мощный иммуностимулятор и сейчас он нам необходим больше всего. Тем более, он очень вкусный и сытный. Настоящая находка для нас всех!</p>'],
            ['Урбеч з гарбузового насіння 300г', 'Урбеч из тыквенных семечек 300г', 170, 0, 300, 1, 16,
                '',
                '<h1>Урбеч из тыквенных семечек</h1>
<p>Хотим поделится с вами нашим любимым тыквенным урбечем. За окном коронавирус, а значит такая баночка точно должна быть у вас в холодильнике. Дело в том, что тыквенные семечки богаты цинком. А как мы помним, цинк мощный иммуностимулятор и сейчас он нам необходим больше всего. Тем более, он очень вкусный и сытный. Настоящая находка для нас всех!</p>'],
            ['Гранола в зіп пакеті 250г American Tropic', 'Гранола в зип пакете 250г American Tropic', 90, 0, 250, 1, 17,
                '',
                '<h1></h1>
<p>Знакомьтесь, гранола American! В ее состав входят только полезные ингредиенты: овсяные хлопья, мед, яблочное пюре, кунжут, семечки подсолнуха, клюква, изюм, грецкий орех и пряности.

Разве не вкуснятина?</p>'],
            ['Гранола в зіп пакеті 500г Tropic', 'Гранола в зип пакете 500г Tropic', 160, 0, 500, 1, 18,
                '',
                '<h1>Гранола в зіп пакеті 500г Tropic</h1>
<p>Знакомьтесь, гранола Tropic!

В ее состав входят овсяные хлопья, мед, банановое пюре, ананас, папайя и лайм.</p>'],
            ['Гранола в зіп пакеті 1 кг	Choco', 'Гранола в зип пакете 1 кг	Choco', 290, 0, 1, 2, 19,
                '',
                '<h1>Гранола в зіп пакеті 1 кг Choco</h1>
<p>Перед нашей "золотой" гранолой Choco трудно устоять - миндаль, фундук, арахис, апельсиновый сок и цедра, какао, бельгийский шоколад, мед, овсяные хлопья! Ням-ням!</p>'],
            ['Гранола в склі 250г Superfit', 'Гранола в стекле 250г Superfit', 100, 0, 250, 1, 20,
                '',
                '<h1>Гранола в стекле 250г Superfit</h1>
<p>Superfit - овсяные хлопья, ячменные хлопья, пшеничные хлопья, ржаные хлопья, экстракт стевии сухой, яблочное пюре, кокосовая стружка, семена льна, финики, курага, вишня.</p>'],
            ['Гранола в склянці 70г	Vanilla', 'Гранола в стакане 70г Vanilla', 28, 0, 70, 1, 21,
                '',
                '<h1>Гранола в стакане 70г Vanilla</h1>
<p>Vanilla - овсяные хлопья, пшеничные хлопья, ржаные хлопья, экстракт стевии сухой, яблочное пюре, ваниль, кизил, миндаль, семена чиа, изюм, тыквенные семечки.</p>'],
            ['Гранола Orange на сиропі в зіп-пакеті	250г', 'Гранола Orange на сиропе в зип-пакете 250г', 110, 0, 250, 1, 22],
            ['Гранола Orange на сиропі в зіп-пакеті	500г', 'Гранола Orange на сиропе в зип-пакете 500г', 200, 0, 500, 1, 23],
            ['Гранола Orange на сиропі в зіп-пакеті	1кг', 'Гранола Orange на сиропе в зип-пакете 1кг', 360, 0, 1, 2, 24],
            ['Гранола Orange на сиропі в склі 250г', 'Гранола Orange на сиропе в зип-пакете	в стекле 250г', 125, 0, 250, 1, 25],
            ['Енергетичний батончик 50г журавлина/кеш\'ю', 'Энергетический батончик 50г клюква/кешью', 27, 0, 50, 1, 26],

            // 3
            ['Соняшниковий мед "Медик Ведмедик" 40мл', 'Подсолнечный мёд "Медик Ведмедик" 40мл', 23, 0, 40, 3, 1,
                '<h1>Соняшниковий мед</h1>
<p>Кристали соняшникового меду легко тануть у роті, залишаючи після себе приємний фруктовий післясмак з кислинкою. Запах соняшникового меду нагадує свіже сіно, квітковий пилок після дощу, зрілі абрикоси. Цей вид меду  — чемпіон за вмістом глюкози, він є важливою  добавкою для дітей шкільного віку, адже в ньому багато поживних речовин.  Соняшниковий мед — це заряд єнергії, він живить серцевий м\'яз і активізує роботу мозку, його використовують як загальнозміцнюючий і тонізуючий засіб. Особливо корисний  він при захворюваннях шлунково-кишкового тракту. Соняшниковий мед сприяє ефективному виведенню «поганого» холестерину з організму. Його рекомендують тим, хто страждає на атеросклероз, остеопороз, а також невралгію. Саме соняшниковий мед насичений антиоксидантами, вчені довели, що цей вид меду ефективний при боротьбі з артритом і раковими захворюваннями на ранній стадії.</p>',
                ''],
            ['Соняшниковий мед "Медик Ведмедик" 200мл', 'Подсолнечный мёд "Медик Ведмедик" 200мл', 42, 0, 200, 3, 2,
                '<h1>Соняшниковий мед</h1>
<p>Кристали соняшникового меду легко тануть у роті, залишаючи після себе приємний фруктовий післясмак з кислинкою. Запах соняшникового меду нагадує свіже сіно, квітковий пилок після дощу, зрілі абрикоси. Цей вид меду  — чемпіон за вмістом глюкози, він є важливою  добавкою для дітей шкільного віку, адже в ньому багато поживних речовин.  Соняшниковий мед — це заряд єнергії, він живить серцевий м\'яз і активізує роботу мозку, його використовують як загальнозміцнюючий і тонізуючий засіб. Особливо корисний  він при захворюваннях шлунково-кишкового тракту. Соняшниковий мед сприяє ефективному виведенню «поганого» холестерину з організму. Його рекомендують тим, хто страждає на атеросклероз, остеопороз, а також невралгію. Саме соняшниковий мед насичений антиоксидантами, вчені довели, що цей вид меду ефективний при боротьбі з артритом і раковими захворюваннями на ранній стадії.</p>',
                ''],
            ['Соняшниковий мед "Медик Ведмедик" 370мл', 'Подсолнечный мёд "Медик Ведмедик" 370мл', 63, 0, 370, 3, 3,
                '<h1>Соняшниковий мед</h1>
<p>Кристали соняшникового меду легко тануть у роті, залишаючи після себе приємний фруктовий післясмак з кислинкою. Запах соняшникового меду нагадує свіже сіно, квітковий пилок після дощу, зрілі абрикоси. Цей вид меду  — чемпіон за вмістом глюкози, він є важливою  добавкою для дітей шкільного віку, адже в ньому багато поживних речовин.  Соняшниковий мед — це заряд єнергії, він живить серцевий м\'яз і активізує роботу мозку, його використовують як загальнозміцнюючий і тонізуючий засіб. Особливо корисний  він при захворюваннях шлунково-кишкового тракту. Соняшниковий мед сприяє ефективному виведенню «поганого» холестерину з організму. Його рекомендують тим, хто страждає на атеросклероз, остеопороз, а також невралгію. Саме соняшниковий мед насичений антиоксидантами, вчені довели, що цей вид меду ефективний при боротьбі з артритом і раковими захворюваннями на ранній стадії.</p>',
                ''],
            ['Соняшниковий мед "Медик Ведмедик" 850мл', 'Подсолнечный мёд "Медик Ведмедик" 850мл', 145, 0, 850, 3, 4,
                '<h1>Соняшниковий мед</h1>
<p>Кристали соняшникового меду легко тануть у роті, залишаючи після себе приємний фруктовий післясмак з кислинкою. Запах соняшникового меду нагадує свіже сіно, квітковий пилок після дощу, зрілі абрикоси. Цей вид меду  — чемпіон за вмістом глюкози, він є важливою  добавкою для дітей шкільного віку, адже в ньому багато поживних речовин.  Соняшниковий мед — це заряд єнергії, він живить серцевий м\'яз і активізує роботу мозку, його використовують як загальнозміцнюючий і тонізуючий засіб. Особливо корисний  він при захворюваннях шлунково-кишкового тракту. Соняшниковий мед сприяє ефективному виведенню «поганого» холестерину з організму. Його рекомендують тим, хто страждає на атеросклероз, остеопороз, а також невралгію. Саме соняшниковий мед насичений антиоксидантами, вчені довели, що цей вид меду ефективний при боротьбі з артритом і раковими захворюваннями на ранній стадії.</p>',
                ''],
            ['Квітковий пилок "Медик Ведмедик" 200мл', 'Цветочная пыльца "Медик Ведмедик" 200мл', 52, 0, 200, 3, 5,
                '<h1></h1>
<p>Квітковий пилок – один із найцінніших продуктів бджільництва, адже склад цього корисного дару природи вражає своєю різноманітністю: амінокислоти, вітаміни та ферменти – загалом понад 300 мікроречовин. Він є ефективним засобом при лікуванні коліту, діабету та недокрів’я.  Також пилок допомагає захищати клітини організму, уповільнюючи старіння¸ виступає загальнозміцнюючим та протизапальним засобом. Найкраще вживати його на голодний шлунок в першій половині дня, оскільки він володіє хорошими тонізуючими властивостями. Не рекомендується запивати пилок водою, але можна додавати до звичайного меду або змішувати з цукром. Намагайтеся якомога довше затримувати пилок в ротовій порожнині, забезпечуючи цим повне засвоєння усіх корисних елементів. Вживаючи квітковий пилок – Ви обираєте найкращий природній вітамін – ідеальне поєднання усіх корисних компонентів для Вашого здоров’я!</p>',
                ''],
            ['Квітковий пилок "Медик Ведмедик" 850мл', 'Цветочная пыльца "Медик Ведмедик" 850мл', 70, 0, 850, 3, 6,
                '<h1></h1>
<p>Квітковий пилок – один із найцінніших продуктів бджільництва, адже склад цього корисного дару природи вражає своєю різноманітністю: амінокислоти, вітаміни та ферменти – загалом понад 300 мікроречовин. Він є ефективним засобом при лікуванні коліту, діабету та недокрів’я.  Також пилок допомагає захищати клітини організму, уповільнюючи старіння¸ виступає загальнозміцнюючим та протизапальним засобом. Найкраще вживати його на голодний шлунок в першій половині дня, оскільки він володіє хорошими тонізуючими властивостями. Не рекомендується запивати пилок водою, але можна додавати до звичайного меду або змішувати з цукром. Намагайтеся якомога довше затримувати пилок в ротовій порожнині, забезпечуючи цим повне засвоєння усіх корисних елементів. Вживаючи квітковий пилок – Ви обираєте найкращий природній вітамін – ідеальне поєднання усіх корисних компонентів для Вашого здоров’я!</p>',
                ''],
            ['Мед з різнотрав\'я "Медик Ведмедик" 40мл', 'Мёд из разнотравья "Медик Ведмедик" 40мл', 23, 0, 40, 3, 7,
                '<h1>Мед з різнотрав\'я</h1>
<p>Мед з різнотрав\'я — це особливе поєднання смаку та аромату найкращих лісових та лугових медоносів. Вишуканий смак нектарів липи, шипшини,  кульбаби не залишить Вас байдужими, огорне ніжними ароматами шавлії та чебрецю і подарує чудовий суничний присмак. Класичний колір натурального меду з різнотрав\'я має пріємні відтінки, від солодко бурштинового до яскраво жовтого. Він позитивно впливає на нирки та сечовидільну систему,  виразку і онкологічні захворювання.  Такий мед ефективний у боротьбі з застудами, бронхітом, його приємний квітковий аромат сприяє зняттю нервового напруження, заспокоєння. У ньому містяться необхідні організму людини фруктоза, глюкоза, мікро та макроелементи, ферменти та вітаміни. Цей вид меду має яскраво виражену бактерицидну дію, а отже може застосовуватися для лікування різних шкірних захворювань. Крім цього, мед з різнотрав\'я має захисний і відновлючий ефект та характеризується високою поживністю.</p>',
                ''],
            ['Мед з різнотрав\'я "Медик Ведмедик" 200мл', 'Мёд из разнотравья "Медик Ведмедик" 200мл', 52, 0, 200, 3, 8,
                '<h1>Мед з різнотрав\'я</h1>
<p>Мед з різнотрав\'я — це особливе поєднання смаку та аромату найкращих лісових та лугових медоносів. Вишуканий смак нектарів липи, шипшини,  кульбаби не залишить Вас байдужими, огорне ніжними ароматами шавлії та чебрецю і подарує чудовий суничний присмак. Класичний колір натурального меду з різнотрав\'я має пріємні відтінки, від солодко бурштинового до яскраво жовтого. Він позитивно впливає на нирки та сечовидільну систему,  виразку і онкологічні захворювання.  Такий мед ефективний у боротьбі з застудами, бронхітом, його приємний квітковий аромат сприяє зняттю нервового напруження, заспокоєння. У ньому містяться необхідні організму людини фруктоза, глюкоза, мікро та макроелементи, ферменти та вітаміни. Цей вид меду має яскраво виражену бактерицидну дію, а отже може застосовуватися для лікування різних шкірних захворювань. Крім цього, мед з різнотрав\'я має захисний і відновлючий ефект та характеризується високою поживністю.</p>',
                ''],
            ['Мед з різнотрав\'я "Медик Ведмедик" 370мл', 'Мёд из разнотравья "Медик Ведмедик" 370мл', 70, 0, 370, 3, 9,
                '<h1>Мед з різнотрав\'я</h1>
<p>Мед з різнотрав\'я — це особливе поєднання смаку та аромату найкращих лісових та лугових медоносів. Вишуканий смак нектарів липи, шипшини,  кульбаби не залишить Вас байдужими, огорне ніжними ароматами шавлії та чебрецю і подарує чудовий суничний присмак. Класичний колір натурального меду з різнотрав\'я має пріємні відтінки, від солодко бурштинового до яскраво жовтого. Він позитивно впливає на нирки та сечовидільну систему,  виразку і онкологічні захворювання.  Такий мед ефективний у боротьбі з застудами, бронхітом, його приємний квітковий аромат сприяє зняттю нервового напруження, заспокоєння. У ньому містяться необхідні організму людини фруктоза, глюкоза, мікро та макроелементи, ферменти та вітаміни. Цей вид меду має яскраво виражену бактерицидну дію, а отже може застосовуватися для лікування різних шкірних захворювань. Крім цього, мед з різнотрав\'я має захисний і відновлючий ефект та характеризується високою поживністю.</p>',
                ''],
            ['Мед з різнотрав\'я "Медик Ведмедик" 850мл', 'Мёд из разнотравья 850мл', 145, 0, 850, 3, 10,
                '<h1>Мед з різнотрав\'я</h1>
<p>Мед з різнотрав\'я — це особливе поєднання смаку та аромату найкращих лісових та лугових медоносів. Вишуканий смак нектарів липи, шипшини,  кульбаби не залишить Вас байдужими, огорне ніжними ароматами шавлії та чебрецю і подарує чудовий суничний присмак. Класичний колір натурального меду з різнотрав\'я має пріємні відтінки, від солодко бурштинового до яскраво жовтого. Він позитивно впливає на нирки та сечовидільну систему,  виразку і онкологічні захворювання.  Такий мед ефективний у боротьбі з застудами, бронхітом, його приємний квітковий аромат сприяє зняттю нервового напруження, заспокоєння. У ньому містяться необхідні організму людини фруктоза, глюкоза, мікро та макроелементи, ферменти та вітаміни. Цей вид меду має яскраво виражену бактерицидну дію, а отже може застосовуватися для лікування різних шкірних захворювань. Крім цього, мед з різнотрав\'я має захисний і відновлючий ефект та характеризується високою поживністю.</p>',
                ''],
            ['Травневий мед "Медик Ведмедик" 40мл', 'Майский мёд "Медик Ведмедик" 40мл', 23, 0, 40, 3, 11,
                '<h1>Травневий мед</h1>
<p>Це перший мед, який бджоли збирають з цвітіння фруктових дерев та акації. Він має приємний солодкий смак і жодної нотки гіркоти. Травневий мед — чудовий гостинець для любителів ласощів за вашим столом. Це найбільш ранній з усіх зібраних протягом року видів меду — містить у собі все найкраще і найцінніше, що може подарувати природа. Це найбільш «активний» мед, який здавна цінується в народній медицині.
Травневий мед — перший мед, який з\'являється в стільниках після тривалої зимівлі бджіл. У цей час бджоли збирають нектар із великої кількості видів рослин, тому травневий мед містить безліч ароматичних мінеральних солей, мікроелементів та інших речовин. Травневий мед надає широку цілющу дію на організм, завдяки підвищеному вмісту мінеральних речовин, а також вітамінів, фруктози та глюкози. Залежно від того, нектару яких рослин в меді більше, властивості меду будуть відрізнятися.</p>',
                ''],
            ['Травневий мед "Медик Ведмедик" 200мл', 'Майский мёд "Медик Ведмедик" 200мл', 52, 0, 200, 3, 12,
                '<h1>Травневий мед</h1>
<p>Це перший мед, який бджоли збирають з цвітіння фруктових дерев та акації. Він має приємний солодкий смак і жодної нотки гіркоти. Травневий мед — чудовий гостинець для любителів ласощів за вашим столом. Це найбільш ранній з усіх зібраних протягом року видів меду — містить у собі все найкраще і найцінніше, що може подарувати природа. Це найбільш «активний» мед, який здавна цінується в народній медицині.
Травневий мед — перший мед, який з\'являється в стільниках після тривалої зимівлі бджіл. У цей час бджоли збирають нектар із великої кількості видів рослин, тому травневий мед містить безліч ароматичних мінеральних солей, мікроелементів та інших речовин. Травневий мед надає широку цілющу дію на організм, завдяки підвищеному вмісту мінеральних речовин, а також вітамінів, фруктози та глюкози. Залежно від того, нектару яких рослин в меді більше, властивості меду будуть відрізнятися.</p>',
                ''],
            ['Травневий мед "Медик Ведмедик" 370мл', 'Майский мёд "Медик Ведмедик" 370мл', 70, 0, 370, 3, 13,
                '<h1>Травневий мед</h1>
<p>Це перший мед, який бджоли збирають з цвітіння фруктових дерев та акації. Він має приємний солодкий смак і жодної нотки гіркоти. Травневий мед — чудовий гостинець для любителів ласощів за вашим столом. Це найбільш ранній з усіх зібраних протягом року видів меду — містить у собі все найкраще і найцінніше, що може подарувати природа. Це найбільш «активний» мед, який здавна цінується в народній медицині.
Травневий мед — перший мед, який з\'являється в стільниках після тривалої зимівлі бджіл. У цей час бджоли збирають нектар із великої кількості видів рослин, тому травневий мед містить безліч ароматичних мінеральних солей, мікроелементів та інших речовин. Травневий мед надає широку цілющу дію на організм, завдяки підвищеному вмісту мінеральних речовин, а також вітамінів, фруктози та глюкози. Залежно від того, нектару яких рослин в меді більше, властивості меду будуть відрізнятися.</p>',
                ''],
            ['Травневий мед "Медик Ведмедик" 850мл', 'Майский мёд "Медик Ведмедик" 850мл', 145, 0, 850, 3, 14,
                '<h1>Травневий мед</h1>
<p>Це перший мед, який бджоли збирають з цвітіння фруктових дерев та акації. Він має приємний солодкий смак і жодної нотки гіркоти. Травневий мед — чудовий гостинець для любителів ласощів за вашим столом. Це найбільш ранній з усіх зібраних протягом року видів меду — містить у собі все найкраще і найцінніше, що може подарувати природа. Це найбільш «активний» мед, який здавна цінується в народній медицині.
Травневий мед — перший мед, який з\'являється в стільниках після тривалої зимівлі бджіл. У цей час бджоли збирають нектар із великої кількості видів рослин, тому травневий мед містить безліч ароматичних мінеральних солей, мікроелементів та інших речовин. Травневий мед надає широку цілющу дію на організм, завдяки підвищеному вмісту мінеральних речовин, а також вітамінів, фруктози та глюкози. Залежно від того, нектару яких рослин в меді більше, властивості меду будуть відрізнятися.</p>',
                ''],
            ['Акацієвий мед "Медик Ведмедик" 40мл', 'Акациевый мёд "Медик Ведмедик" 40мл', 23, 0, 40, 3, 15,
                '<h1></h1>
<p>Акацієвий мед один із найвишуканіших сортів цього корисного дару природи, тонкий аромат якого нагадує про білі суцвіття, а смак чарує невимовною ніжністю. Легкі обволікаючі квіткові ноти розкривають свій потужний солодкий смак, несучи Вам усю користь справжнього акацієвого меду, дбайливо зібраного нашими бджілками. Завдяки фруктозі він є найбільшим джерелом плодового цукру серед усіх солодких продуктів, а правильна технологія збору та фасування гарантує збереження усіх цілющих властивостей меду для Вас. Саме акацієвий мед рекомендують як найперший для дитини, адже він легко засвоюється організмом. А ще у складі меду є органічні кислоти – яблучна, лимонна, винна, молочна і щавлева. Акацієвий мед застосовується як загальнозміцнюючий і заспокійливий засіб, він допоможе при безсонні, жовчних, ниркових і шлунково-кишкових захворюваннях. Також цей продукт особливо підходить людям, страждаючим від алергії на пилок та діабетикам, так як в ньому практично відсутні пилкові зерна.</p>',
                ''],
            ['Акацієвий мед "Медик Ведмедик" 200мл', 'Акациевый мёд "Медик Ведмедик" 200мл', 52, 0, 200, 3, 16,
                '<h1></h1>
<p>Акацієвий мед один із найвишуканіших сортів цього корисного дару природи, тонкий аромат якого нагадує про білі суцвіття, а смак чарує невимовною ніжністю. Легкі обволікаючі квіткові ноти розкривають свій потужний солодкий смак, несучи Вам усю користь справжнього акацієвого меду, дбайливо зібраного нашими бджілками. Завдяки фруктозі він є найбільшим джерелом плодового цукру серед усіх солодких продуктів, а правильна технологія збору та фасування гарантує збереження усіх цілющих властивостей меду для Вас. Саме акацієвий мед рекомендують як найперший для дитини, адже він легко засвоюється організмом. А ще у складі меду є органічні кислоти – яблучна, лимонна, винна, молочна і щавлева. Акацієвий мед застосовується як загальнозміцнюючий і заспокійливий засіб, він допоможе при безсонні, жовчних, ниркових і шлунково-кишкових захворюваннях. Також цей продукт особливо підходить людям, страждаючим від алергії на пилок та діабетикам, так як в ньому практично відсутні пилкові зерна.</p>',
                ''],
            ['Акацієвий мед "Медик Ведмедик" 370мл', 'Акациевый мёд "Медик Ведмедик" 370мл', 70, 0, 370, 3, 17,
                '<h1></h1>
<p>Акацієвий мед один із найвишуканіших сортів цього корисного дару природи, тонкий аромат якого нагадує про білі суцвіття, а смак чарує невимовною ніжністю. Легкі обволікаючі квіткові ноти розкривають свій потужний солодкий смак, несучи Вам усю користь справжнього акацієвого меду, дбайливо зібраного нашими бджілками. Завдяки фруктозі він є найбільшим джерелом плодового цукру серед усіх солодких продуктів, а правильна технологія збору та фасування гарантує збереження усіх цілющих властивостей меду для Вас. Саме акацієвий мед рекомендують як найперший для дитини, адже він легко засвоюється організмом. А ще у складі меду є органічні кислоти – яблучна, лимонна, винна, молочна і щавлева. Акацієвий мед застосовується як загальнозміцнюючий і заспокійливий засіб, він допоможе при безсонні, жовчних, ниркових і шлунково-кишкових захворюваннях. Також цей продукт особливо підходить людям, страждаючим від алергії на пилок та діабетикам, так як в ньому практично відсутні пилкові зерна.</p>',
                ''],
            ['Акацієвий мед "Медик Ведмедик" 850мл', 'Акациевый мёд "Медик Ведмедик" 850мл', 165, 0, 850, 3, 18,
                '<h1></h1>
<p>Акацієвий мед один із найвишуканіших сортів цього корисного дару природи, тонкий аромат якого нагадує про білі суцвіття, а смак чарує невимовною ніжністю. Легкі обволікаючі квіткові ноти розкривають свій потужний солодкий смак, несучи Вам усю користь справжнього акацієвого меду, дбайливо зібраного нашими бджілками. Завдяки фруктозі він є найбільшим джерелом плодового цукру серед усіх солодких продуктів, а правильна технологія збору та фасування гарантує збереження усіх цілющих властивостей меду для Вас. Саме акацієвий мед рекомендують як найперший для дитини, адже він легко засвоюється організмом. А ще у складі меду є органічні кислоти – яблучна, лимонна, винна, молочна і щавлева. Акацієвий мед застосовується як загальнозміцнюючий і заспокійливий засіб, він допоможе при безсонні, жовчних, ниркових і шлунково-кишкових захворюваннях. Також цей продукт особливо підходить людям, страждаючим від алергії на пилок та діабетикам, так як в ньому практично відсутні пилкові зерна.</p>',
                ''],
            ['Липовий мед "Медик Ведмедик" 40мл', 'Липовый мёд "Медик Ведмедик" 40мл', 23, 0, 40, 3, 19],
            ['Липовий мед "Медик Ведмедик" 200ммл', 'Липовый мёд "Медик Ведмедик" 200ммл', 52, 0, 200, 3, 20],
            ['Липовий мед "Медик Ведмедик" 370мл', 'Липовый мёд "Медик Ведмедик" 370мл', 70, 0, 370, 3, 21],
            ['Липовий мед "Медик Ведмедик" 850мл', 'Липовый мёд "Медик Ведмедик" 850мл', 145, 0, 850, 3, 22],
            ['Гречаний мед "Медик Ведмедик" 40мл', 'Гречишный мёд "Медик Ведмедик" 40мл', 23, 0, 40, 3, 23],
            ['Гречаний мед "Медик Ведмедик" 200мл', 'Гречишный мёд "Медик Ведмедик" 200мл', 52, 0, 200, 3, 24],
            ['Гречаний мед "Медик Ведмедик" 370мл', 'Гречишный мёд "Медик Ведмедик" 370мл', 70, 0, 370, 3, 25],
            ['Гречаний мед "Медик Ведмедик" 850мл', 'Гречишный мёд "Медик Ведмедик" 850мл', 145, 0, 850, 3, 26],
            ['Мед буркун-різнотрав’я "Медик Ведмедик" 40мл', 'Мёд донник-разнотравье "Медик Ведмедик" 40мл', 23, 0, 40, 3, 27,
                '<h1>Мед буркун-різнотрав’я</h1>
<p>Буркуновий та різнотрав\'я мед — це найвишуканіші сорти, високо ціновані своїми цілющими властивостями. Такий мед має світло-бурштиновий колір, який поєднується з тонким приємним ароматом, що нагадує запах натуральної ванілі. Ніжний і легкий смак буркунового меду вдало поєднується з гіркуватим присмаком різнотрав\'я, поступово розкриваючи всю гамму смакових відчуттів. Еталонним медом вважають цей сорти через його лікарські  властивості. Буркуновий мед має заспокійливу, сечогінну, відхаркувальну, антибактеріальну, протизапальну, болезаспокійливу дії і стимулює виділення молока у годуючих матерів. Мед різнотрав\'я використовують при шлунково-кишкових захворюваннях (гастрити, ентероколіти), саме його рекомендують при безсонні, так як він має заспокійливу дію на нервову систему. Буркуновий і мед різнотрав\'я — це максимально ефективне поєдання неповторного смаку і користі в одній баночці!</p>',
                ''],
            ['Мед буркун-різнотрав’я "Медик Ведмедик" 200мл', 'Мёд донник-разнотравье "Медик Ведмедик" 200мл', 52, 0, 200, 3, 28,
                '<h1>Мед буркун-різнотрав’я</h1>
<p>Буркуновий та різнотрав\'я мед — це найвишуканіші сорти, високо ціновані своїми цілющими властивостями. Такий мед має світло-бурштиновий колір, який поєднується з тонким приємним ароматом, що нагадує запах натуральної ванілі. Ніжний і легкий смак буркунового меду вдало поєднується з гіркуватим присмаком різнотрав\'я, поступово розкриваючи всю гамму смакових відчуттів. Еталонним медом вважають цей сорти через його лікарські  властивості. Буркуновий мед має заспокійливу, сечогінну, відхаркувальну, антибактеріальну, протизапальну, болезаспокійливу дії і стимулює виділення молока у годуючих матерів. Мед різнотрав\'я використовують при шлунково-кишкових захворюваннях (гастрити, ентероколіти), саме його рекомендують при безсонні, так як він має заспокійливу дію на нервову систему. Буркуновий і мед різнотрав\'я — це максимально ефективне поєдання неповторного смаку і користі в одній баночці!</p>',
                ''],
            ['Мед буркун-різнотрав’я "Медик Ведмедик" 370мл', 'Мёд донник-разнотравье "Медик Ведмедик" 370мл', 70, 0, 370, 3, 29,
                '<h1>Мед буркун-різнотрав’я</h1>
<p>Буркуновий та різнотрав\'я мед — це найвишуканіші сорти, високо ціновані своїми цілющими властивостями. Такий мед має світло-бурштиновий колір, який поєднується з тонким приємним ароматом, що нагадує запах натуральної ванілі. Ніжний і легкий смак буркунового меду вдало поєднується з гіркуватим присмаком різнотрав\'я, поступово розкриваючи всю гамму смакових відчуттів. Еталонним медом вважають цей сорти через його лікарські  властивості. Буркуновий мед має заспокійливу, сечогінну, відхаркувальну, антибактеріальну, протизапальну, болезаспокійливу дії і стимулює виділення молока у годуючих матерів. Мед різнотрав\'я використовують при шлунково-кишкових захворюваннях (гастрити, ентероколіти), саме його рекомендують при безсонні, так як він має заспокійливу дію на нервову систему. Буркуновий і мед різнотрав\'я — це максимально ефективне поєдання неповторного смаку і користі в одній баночці!</p>',
                ''],
            ['Мед буркун-різнотрав’я "Медик Ведмедик" 850мл', 'Мёд донник-разнотравье "Медик Ведмедик" 850мл', 145, 0, 850, 3, 30,
                '<h1>Мед буркун-різнотрав’я</h1>
<p>Буркуновий та різнотрав\'я мед — це найвишуканіші сорти, високо ціновані своїми цілющими властивостями. Такий мед має світло-бурштиновий колір, який поєднується з тонким приємним ароматом, що нагадує запах натуральної ванілі. Ніжний і легкий смак буркунового меду вдало поєднується з гіркуватим присмаком різнотрав\'я, поступово розкриваючи всю гамму смакових відчуттів. Еталонним медом вважають цей сорти через його лікарські  властивості. Буркуновий мед має заспокійливу, сечогінну, відхаркувальну, антибактеріальну, протизапальну, болезаспокійливу дії і стимулює виділення молока у годуючих матерів. Мед різнотрав\'я використовують при шлунково-кишкових захворюваннях (гастрити, ентероколіти), саме його рекомендують при безсонні, так як він має заспокійливу дію на нервову систему. Буркуновий і мед різнотрав\'я — це максимально ефективне поєдання неповторного смаку і користі в одній баночці!</p>',
                ''],
            ['Суміш меду з імбирем та лимоном "Медик Ведмедик" 40мл', 'Смесь мёда с имбирём и лимоном "Медик Ведмедик" 40мл', 23, 0, 40, 3, 31,
                '<h1>Суміш меду з імбирем та лимоном</h1>
<p>Що може бути краще ніж імбирний чай, мед та скибочка лимону? Лише наша суміш, яка поєднує в собі одразу всі інгредієнти! Солодкий соняшниковий мед має вишуканий гіркуватий імбирний присмак, а краплинка лимонного соку додає кислинки, що, поєднуючись, створює надзвичайно корисну суміш. Завдяки антибактеріальним та противірусним  властивостям меду, імбиру та лимону, суміш корисно вживати у зимовий та осінній періоди,  а також для зміцнення імунітету та загального самопочуття у будь-яку пору року! </p>',
                ''],
            ['Суміш меду з імбирем та лимоном "Медик Ведмедик" 200мл', 'Смесь мёда с имбирём и лимоном "Медик Ведмедик" 200мл', 60, 0, 200, 3, 32,
                '<h1>Суміш меду з імбирем та лимоном</h1>
<p>Що може бути краще ніж імбирний чай, мед та скибочка лимону? Лише наша суміш, яка поєднує в собі одразу всі інгредієнти! Солодкий соняшниковий мед має вишуканий гіркуватий імбирний присмак, а краплинка лимонного соку додає кислинки, що, поєднуючись, створює надзвичайно корисну суміш. Завдяки антибактеріальним та противірусним  властивостям меду, імбиру та лимону, суміш корисно вживати у зимовий та осінній періоди,  а також для зміцнення імунітету та загального самопочуття у будь-яку пору року! </p>',
                ''],
            ['Суміш меду з корицею та ваніллю "Медик Ведмедик" 40мл', 'Смесь мёда с корицей и ванилью "Медик Ведмедик" 40мл', 23, 0, 40, 3, 33,
                '',
                '<h1></h1>
<p>Пригадуєте запах свіжої домашньої випічки, коли Вас огортає затишок та спокій? Саме такі відчуття подарує Вам ложечка нашої суміші, яка наповнена ароматами справжньої кориці та ванілі, що вдало поєдналися разом з натуральним соняшниковим медом. Така паста гарно смакує з чаєм та випічкою, а також стане чудовим доповненням до фруктів, зокрема яблук. Спробуйте та відкрийте зовсім новий смак для себе!</p>',
                ''],
            ['Суміш меду з корицею та ваніллю "Медик Ведмедик" 200мл', 'Смесь мёда с корицей и ванилью "Медик Ведмедик" 200мл', 60, 0, 200, 3, 34,
                '',
                '<h1></h1>
<p>Пригадуєте запах свіжої домашньої випічки, коли Вас огортає затишок та спокій? Саме такі відчуття подарує Вам ложечка нашої суміші, яка наповнена ароматами справжньої кориці та ванілі, що вдало поєдналися разом з натуральним соняшниковим медом. Така паста гарно смакує з чаєм та випічкою, а також стане чудовим доповненням до фруктів, зокрема яблук. Спробуйте та відкрийте зовсім новий смак для себе!</p>',
                ''],
            ['Суміш меду з розмарином "Медик Ведмедик" 40мл', 'Смесь мёда с розмарином "Медик Ведмедик" 40мл', 23, 0, 40, 3, 35],
            ['Суміш меду з розмарином "Медик Ведмедик" 200мл', 'Смесь мёда с розмарином "Медик Ведмедик" 200мл', 60, 0, 200, 3, 36],
            ['Суміш меду з малиною "Медик Ведмедик" 40мл', 'Смесь мёда с малиной "Медик Ведмедик" 40мл', 23, 0, 40, 3, 37,
                '<h1></h1>
<p>Наш смачний крем мед з малиною – ідеальне частування для любителів малини! Терпкий, солодкий аромат малини та користь натурального меду. Медова суміш має оксамитову гладку консистенцію, яка не розтікається та не вимагає охолодження. Насолоджуйтесь цим з тостами, вафлями, йогуртом, вівсянкою, з чаєм або з морозивом. З усім, що вимагає малину!</p>',
                ''],
            ['Суміш меду з малиною "Медик Ведмедик" 200мл', 'Смесь мёда с малиной "Медик Ведмедик" 200мл', 60, 0, 200, 3, 38,
                '<h1></h1>
<p>Наш смачний крем мед з малиною – ідеальне частування для любителів малини! Терпкий, солодкий аромат малини та користь натурального меду. Медова суміш має оксамитову гладку консистенцію, яка не розтікається та не вимагає охолодження. Насолоджуйтесь цим з тостами, вафлями, йогуртом, вівсянкою, з чаєм або з морозивом. З усім, що вимагає малину!</p>',
                ''],
            ['Суміш меду з волоським горіхом "Медик Ведмедик" 40мл', 'Смесь мёда с грецким орехом "Медик Ведмедик" 40мл', 23, 0, 40, 3, 39,
                '<h1>Суміш меду з волоським горіхом</h1>
<p>Суміш волоського горіха з медом — не просто вдале смакове поєднання, але й надзвичайно корисний продукт, адже ядра горіха містять вітаміни А, С, Е, В1, В2, залізо, калій, кальцій, мідь, цинк, йод, кобальт та інші мікроелементи. Цікаво зауважити, що за кількістю вітаміну С волоські горіхи перевершують чорну смородину в 8 разів, і в 50 разів плоди цитрусових. Суміш волоського горіху з медом відновлює життєві сили організму та надзвичайно корисна для підвищення імунітету!</p>',
                ''],
            ['Суміш меду з волоським горіхом "Медик Ведмедик" 200мл', 'Смесь мёда с грецким орехом "Медик Ведмедик" 200мл', 60, 0, 200, 3, 40,
                '<h1>Суміш меду з волоським горіхом</h1>
<p>Суміш волоського горіха з медом — не просто вдале смакове поєднання, але й надзвичайно корисний продукт, адже ядра горіха містять вітаміни А, С, Е, В1, В2, залізо, калій, кальцій, мідь, цинк, йод, кобальт та інші мікроелементи. Цікаво зауважити, що за кількістю вітаміну С волоські горіхи перевершують чорну смородину в 8 разів, і в 50 разів плоди цитрусових. Суміш волоського горіху з медом відновлює життєві сили організму та надзвичайно корисна для підвищення імунітету!</p>',
                ''],
            ['Суміш меду з облепіхою та лаймом "Медик Ведмедик" 40мл', 'Смесь мёда с обепихой и лаймом "Медик Ведмедик" 40 мл', 23, 0, 40, 3, 41,
                '<h1>Суміш меду з облепіхою та лаймом</h1>
<p>Протизапальні та бактерицидні властивості обліпихи прекрасно доповнюються заспокоюючим впливом лайму на нервову систему, а той факт, що соняшниковий мед виводить токсини із організму, ідеально завершує загальну картину. Більш того, суміш має приємний кисло-солодкий смак, який нікого не залишить байдужим. А хто сказав, що корисне не може бути смачним?</p>',
                ''],
            ['Суміш меду з облепіхою та лаймом "Медик Ведмедик" 200мл', 'Смесь мёда с обепихой и лаймом "Медик Ведмедик" 200 мл', 60, 0, 200, 3, 42,
                '<h1>Суміш меду з облепіхою та лаймом</h1>
<p>Протизапальні та бактерицидні властивості обліпихи прекрасно доповнюються заспокоюючим впливом лайму на нервову систему, а той факт, що соняшниковий мед виводить токсини із організму, ідеально завершує загальну картину. Більш того, суміш має приємний кисло-солодкий смак, який нікого не залишить байдужим. А хто сказав, що корисне не може бути смачним?</p>',
                ''],
            ['Варення "Казковий світ" Абрикос-мигдаль-волоський горіх 360мл', 'Варенье "Казковий світ" Абрикос-миндаль-грецкий орех 360мл', 80, 0, 360, 3, 43,
                '',
                '<h1>Варенье Абрикос-миндаль-грецкий орех</h1>
<p>Изысканное и соблазнительное, добродетель сердца и вкуса. Волшебная фруктовая баночка с ореховыми лабиринтами. Вкусное, яркое, создающее особенную атмосферу, праздник.</p>'],
            ['Варення "Казковий світ" Груша–лимон 350мл', 'Варенье "Казковий світ" Груша – лимон 350мл', 80, 0, 350, 3, 44],
            ['Варення "Казковий світ" Полуниця-апельсин 335мл', 'Варенье "Казковий світ" Клубника–апельсин 335мл', 80, 0, 335, 3, 45,
                '',
                '<h1>Варенье Клубника–апельсин</h1>
<p>Восхитительно ароматное клубничное варенье с добавлением апельсина.

Клубнички, маленькие ягодные сердца – сильнейший приворот.

В нашей баночке с клубничным вареньем, пробуют на вкус лето – начинают с ложечки, берут баночками.</p>'],
            ['Варення "Казковий світ" Агрус-апельсин 370мл', 'Варенье "Казковий світ" Крыжовник–апельсин 370мл', 80, 0, 370, 3, 46,
                '',
                '<h1>Варенье Крыжовник–апельсин</h1>
<p>Вкусное и ароматное, когда открываешь эту баночку варенья из крыжовника зимой, краски и запахи лета буквально выпрыгивают оттуда, напевая радостные воспоминания о тепле и солнце.

Апельсин придает варенью яркости, свежего воздуха и душистости.</p>'],
            ['Варення "Казковий світ" Малина-м\'ята 400мл', 'Варенье "Казковий світ" Малина-мята 400мл', 80, 0, 400, 3, 47,
                '',
                '<h1>Варенье Малина-мята</h1>
<p>Не просто варенье, а наслаждение. Это сладкое волшебство. Мята придаёт малине особенную нежность. Если вдруг случилось заболеть, лечитесь правильно и с удовольствием: откройте баночку такого варенья, положите 2-3 чайные ложки в чай. Температуру и простуду, как рукой снимет. Самое любимое лекарство :)</p>'],
            ['Варення "Казковий світ" Мандарин "Клементіно" 400мл', 'Варенье "Казковий світ" Мандарин "Клементино" 400мл', 80, 0, 400, 3, 48,
                '',
                '<h1>Варенье Мандарин "Клементино"</h1>
<p>«We did it», что в переводе с английского означает – мы сделали это! Мы таки сделали варенье из мандаринок такое, какое нам хотелось – по цвету, по вкусу, по аромату и по внешнему виду. Пусть эти сладкие экзотические фрукты цвета солнца, согреют Ваши сердца!</p>'],
            ['Варення "Казковий світ" Персик 340мл', 'Варенье "Казковий світ" Персик 340мл', 80, 0, 340, 3, 49,
                '',
                '<h1></h1>
<p>Счастье в персиковом цвете – доступное и простое, в то же время роскошное. Восхитительно ароматное, налитое радостью земли и согретое ласковым солнцем.

Персик необычный вкус имеет – перед ним любой здесь обомлеет.</p>'],
            ['Варення "Казковий світ" Чорна смородина-кава-горіх 380мл', 'Варенье "Казковий світ" Чёрная смородина–кофе-орех 380мл', 80, 0, 380, 3, 50,
                '',
                '<h1>Варенье Чёрная смородина–кофе-орех 380мл</h1>
<p>Смородины ягоды - волшебные черные жемчуженки. Смородиновое варенье –
это не только очень красиво, вкусно, но еще и чрезвычайно полезно, и кушать его
непременно нужно всем, кто следит за своим здоровьем и хочет прекрасно выглядеть
и также себя чувствовать. Смородина – одна из самых полезных ягод среди произрастающих
в нашей стране культур. Она очень богата витаминами Е и С. Благодатный орех и
благородный кофе пробуждают наилучшие человеческие чувства. Это варенье для тех
кто любит, понимает и ценит!</p>'],
            ['Варення "Велика родина" Горіхи асорті-Кульбабове варення 430мл', 'Варенье "Велика родина" Орехи ассорти–одуванчиковое варенье 430мл', 159, 0, 430, 3, 51],
            ['Варення "Велика родина" Айва 430мл', 'Варенье "Велика родина" Айва 460мл', 110, 0, 460, 3, 52,
                '',
                '<h1>Варенье Айва</h1>
<p>Айва очень на грушу похожа,
Но это совсем не одно и то же.
Она тверда, как будто дуб,
Попробуешь – сломаешь зуб.
Но, если сваришь ты варенье,
Получишь удовлетворенье.</p>'],
            ['Варення "Велика родина" Акація Біла 475мл', 'Варенье "Велика родина" Акация Белая 475мл', 139, 0, 475, 3, 53,
                '',
                '<h1>Варенье Акация Белая</h1>
<p>Варенье, сделанное из лепестков акации, собранных из садов, раскрашенных весной.
Эти белые, чистые лепестки внимали повести соловья и впитали силу его песни о любви.
Поистине царское варенье, придающее молодость коже , а сердцу юность.</p>'],
            ['Варення "Велика родина" Лохина лісова 450мл', 'Варенье "Велика родина" Голубика лесная 450мл', 110, 0, 450, 3, 54],
            ['Варення "Велика родина" Грейпфрут 480мл', 'Варенье "Велика родина" Грейпфрут 480мл', 110, 0, 480, 3, 55],
            ['Варення "Велика родина" Груша–лимон 490мл', 'Варенье "Велика родина" Груша–лимон 490мл', 110, 0, 490, 3, 56],
            ['Варення "Велика родина" Канадська журавлина-яблуко 450мл', 'Варенье "Велика родина" Канадская клюква–яблоко 450мл', 110, 0, 450, 3, 57],
            ['Варення "Велика родина" Червона смородина-мигдаль-перець Черрі 430мл', 'Варенье "Велика родина" Красная смородина–миндаль–перец Черри 430мл', 110, 0, 430, 3, 58,
                '',
                '<h1>Варенье Красная смородина–миндаль–перец Черри</h1>
<p>Вот уж действительно буйство красок и вкусов. Красная смородина и вылечит, и настроение поднимет. Удивительное свойство маленького стручка чили перца – дарить на прощание тёплые воспоминания. А вкус миндаля – музыка!!!</p>'],
            ['Варення "Велика родина" Малина-м\'ята 470мл', 'Варенье "Велика родина" Малина–мята 470мл', 110, 0, 470, 3, 59,
                '',
                '<h1>Варенье Малина–мята</h1>
<p>Не просто варенье, а наслаждение. Это сладкое волшебство. Мята придаёт малине
особенную нежность. Если вдруг случилось заболеть, лечитесь правильно и с удовольствием:
откройте баночку такого варенья, положите 2-3 чайные ложки в чай. Температуру и простуду,
как рукой снимет. Самое любимое лекарство :)</p>'],
            ['Джем "Велика родина" Райське яблуко "вишнєплодне" 455мл', 'Джем "Велика родина" Райское яблоко "вишнеплодное" 455мл', 110, 0, 455, 3, 60,
                '',
                '<h1>Джем Райское яблоко "вишнеплодное"</h1>
<p>Варенье из райского яблочка вишнеплодного – рай на земле… Гармония кисло-сладких вкусов, палитра из теплых, ярких цветов… от желания кушать его еще и еще прямо кружится голова. Не откладывайте это удовольствие на потом, заказывайте прямо сейчас.
Там где это варенье, там и наслажденье, там и я, там моя семья, и мои друзья…</p>'],
            ['Варення "Велика родина" Чорна смородина-кава-волоський горіх 440мл', 'Варенье "Велика родина" Чёрная смородина–кофе–грецкий орех 440мл', 110, 0, 440, 3, 61,
                '',
                '<h1>Варенье Чёрная смородина–кофе–грецкий орех</h1>
<p>Смородины ягоды - волшебные черные жемчуженки. Смородиновое варенье –
это не только очень красиво, вкусно, но еще и чрезвычайно полезно, и кушать его
непременно нужно всем, кто следит за своим здоровьем и хочет прекрасно выглядеть
и также себя чувствовать. Смородина – одна из самых полезных ягод среди произрастающих
в нашей стране культур. Она очень богата витаминами Е и С. Благодатный орех и
благородный кофе пробуждают наилучшие человеческие чувства. Это варенье для тех
кто любит, понимает и ценит!</p>'],
            ['Варення "Велика родина" Черешня Біла 470мл', 'Варенье "Велика родина" Черешня Белая 470мл', 120, 0, 470, 3, 62],
            ['Варення "Велика родина" Шовковиця 450мл', 'Варенье "Велика родина" Шелковица 450мл', 110, 0, 450, 3, 63,
                '',
                '<h1>Варенье Шелковица</h1>
<p>Воспоминания о детстве у многих из нас ассоциируются с перепачканными руками с помощью необычной ягоды – шелковицы. Кушая варенье, процесс упрощается, а удовольствие возрастает.
Кисло-сладкое лакомство – очень вкусное и крайне полезное. Ярко выраженное антистрессовое действие. Варенье необычное и притягательное.</p>'],
            ['Натуральні цукерки "Pops" Апельсин', 'Натуральные конфеты "Pops" Апельсин', 25, 0, 0, 0, 64],
            ['Натуральні цукерки "Pops" Банан', 'Натуральные конфеты "Pops" Банан', 25, 0, 0, 0, 65],
            ['Натуральні цукерки "Pops" Вишня', 'Натуральные конфеты "Pops" Вишня', 25, 0, 0, 0, 66],
            ['Натуральні цукерки "Pops" Ківі', 'Натуральные конфеты "Pops" Киви', 25, 0, 0, 0, 67],
            ['Натуральні цукерки "Pops" Лимон-м\'ята', 'Натуральные конфеты "Pops" Лимон-Мята', 25, 0, 0, 0, 68],
            ['Натуральні цукерки "Pops" Малина', 'Натуральные конфеты "Pops" Малина', 25, 0, 0, 0, 69],
            ['Натуральні цукерки "Pops" Полуниця', 'Натуральные конфеты "Pops" Клубника', 25, 0, 0, 0, 70],
            ['Натуральні цукерки "Pops" Смородина', 'Натуральные конфеты "Pops" Смородина', 25, 0, 0, 0, 71],
            ['Натуральні цукерки "Pops" Шовковиця', 'Натуральные конфеты "Pops" Шелковица', 25, 0, 0, 0, 72],

            // 4
            ['Сир Панір POLTON 1кг', 'Сыр Панир POLTON 1кг',140, 0, 1, 2, 1,
                '',
                '<h1>Сыр Панир POLTON</h1>
<p>Панир был придуман случайно . Некий Аравийский торговец-путешественник Ханан взял с собой в дорогу молоко, которое естественно свернулось на жаре . Выкидывать ему было жаль, и он выпил сыворотку, а оставшиеся белые хлопья решил попробовать и ему понравилось . Вернувшись, он поделился находкой с другими, люди стали экспериментировать и на свет появился незаменимый ингредиент большого количества блюд Южной Азии .</p>'],
            ['Сир Панір копчений POLTON 1кг', 'Сыр Панир копчёный POLTON 1кг', 160, 0, 1, 2, 2],
            ['Сир Халлумі POLTON 1кг', 'Сыр Халлуми POLTON 1кг', 240, 0, 1, 2, 3,
                '',
                '<h1>Сыр Халлуми POLTON</h1>
<p>О эта хрустящая корочка и нежнейший сливочный аромат... Понимаете о чем мы ? Конечно же о халлуми!

Это один из самых полюбившихся нам и нашим клиентам сыр, а ожидание от приготовления заставит всю семью сбежаться на кухню

Кстати, процесс приготовления доступен любому члену семьи ведь он невероятно прост! Всего 3 шага и вкуснятина у вас на столе. Покажем наглядно :
1. Режем поперёк на кусочки толщиной с указательный палец (2-ое фото);
2. Кладём на сухую хорошо разогретую сковороду . Масло НЕ добавляем (3-е фото);
3. Жарим с каждой стороны по 30-60 секунд до приятной для вас румяности. И... Накрываем на стол! Приятного аппетита!</p>'],
            ['Сир Халлумі копчений POLTON 1кг', 'Сыр Халлуми копчёный POLTON 1кг', 260, 0, 1, 2, 4],
            ['Сир Скаморца POLTON 1кг', 'Сыр Скаморца POLTON 1кг', 240, 0, 1, 2, 5,
                '',
                '<h1>Сыр Скаморца POLTON</h1>
<p>Это уникальный итальянский сорт сыра, который по своей текстуре и способам применения очень напоминает моцареллу . Нежнейший сливочный вкус определённо найдёт место в ваших гастрономических предпочтениях</p>'],
            ['Сир Качотта POLTON 1кг', 'Сыр Качотта POLTON 1кг', 250, 0, 1, 2, 6,
                '',
                '<h1>Сыр Качотта POLTON</h1>
<p>Почему качотта ? Такое название появилось благодаря небольшому размеру изготавливаемых головок и с итальянского переводится буквально как "сырок" . Это, кстати, один из популярнейших сыров Италии, а рецепту его приготовления более тринадцати веков . Еще сам Микеланджело Буонаротти на протяжении всей своей жизни бережно хранил любовь к этому потрясаещему сыру...</p>'],
            ['Сир Мучлі POLTON 1кг', 'Сыр Мучли POLTON 1кг', 260, 0, 1, 2, 7,
                '',
                '<h1>Сыр Мучли POLTON</h1>
<p>Мучли, к слову, как сыр интересен еще тем, что его практически не делают промышленным способом и он не имеет защищённого названия. Варят его в основном в альпийских деревнях как параллельный сыр Грюйеру или Эмменталю. В каждой семье есть свой рецепт. В итоге тонкостей в рецепте этого сыра столько же, как у каждой украинской хозяйки, которая готовит борщ по-своему .</p>'],
            ['Сир Мучлі копчений томат та букет гарні POLTON 1кг', 'Сыр Мучли копченый томат и букет гарни POLTON 1кг', 280, 0, 1, 2, 8,
                '',
                '<h1></h1>
<p>Ещё одна новинка - мучли с копчеными томатами и букетом гарни !

Вы уже привыкли к вкусу мучли ? Сегодня это семейство пополнилось новым оттенком. Действительно копчёные томаты и знаменитый "букет гарни", которому мы добавили больше пряности за счёт эстрагона, создали очень приятное послевкусие, нам нравится .</p>'],

            // 7
            ['Арахісова олія пляшка 250мл', 'Арахисовое масло бутылка 250мл', 156, 78,  250, 3, 1],
            ['Арахісова олія пляшка 500мл', 'Арахисовое масло бутылка 500мл', 284, 142,  500, 3, 2],
            ['Арахісова олія на розлив 1л', 'Арахисовое масло на разлив 1л', 510, 255, 1, 4, 3],
            ['Волоського горіха олія пляшка 250мл', 'Грецкого ореха масло бутылка 250мл', 154, 0, 250, 3, 4],
            ['Волоського горіха олія пляшка 500мл', 'Грецкого ореха масло бутылка 500мл', 276, 0, 500, 3, 5],
            ['Волоського горіха олія на розлив 1л', 'Грецкого ореха масло на разлив 1л', 486, 0, 1, 4, 6],
            ['Гарбузова олія пляшка 250мл', 'Тыквенное масло бутылка 250мл', 140, 0, 250, 3, 7],
            ['Гарбузова олія пляшка 500мл', 'Тыквенное масло бутылка 500мл', 250, 0, 500, 3, 8],
            ['Гарбузова олія на розлив 1л', 'Тыквенное масло на разлив 1л', 448, 0, 1, 4, 9],
            ['Гірчична олія пляшка 250мл', 'Горчичное масло бутылка 250мл', 104, 0, 250, 3, 10],
            ['Гірчична олія пляшка 500мл', 'Горчичное масло бутылка 500мл', 178, 0, 500, 3, 11],
            ['Гірчична олія на розлив 1л', 'Горчичное масло на разлив 1л', 306, 0, 1, 4, 12],
            ['Кавунова олія пляшка 250мл', 'Арбузное масло бутылка 250мл', 338, 0, 250, 3, 13],
            ['Кавунова олія пляшка 500мл', 'Арбузное масло бутылка 250мл', 644, 0, 500, 3, 14],
            ['Кавунова олія на розлив 1л', 'Арбузное масло на разлив 1л', 1222, 0, 1, 4, 15],
            ['Кедрового горіху олія пляшка 250мл', 'Кедрового ореха масло бутылка 250мл', 792, 0, 250, 3, 16],
            ['Кедрового горіху олія пляшка 500мл', 'Кедрового ореха масло бутылка 250мл', 1560, 0, 500, 3, 17],
            ['Кедрового горіху олія на розлив 1л', 'Кедрового ореха масло на разлив 1л', 3060, 0, 1, 4, 18],
            ['Кмину чорного олія пляшка 250мл', 'Тмина чёрного масло бутылка 250мл', 366, 0, 250, 3, 19],
            ['Кмину чорного олія пляшка 500мл', 'Тмина чёрного масло бутылка 500мл', 698, 0, 500, 3, 20],
            ['Кмину чорного олія на розлив 1л', 'Тмина чёрного масло на разлив 1л', 1336, 0, 1, 4, 21],
            ['Кокосова олія пляшка 250мл', 'Кокосовое масло бутылка 250мл', 134, 0, 250, 3, 22],
            ['Кокосова олія пляшка 500мл', 'Кокосовое масло бутылка 500мл', 244, 0, 500, 3, 23],
            ['Кокосова олія на розлив 1л', 'Кокосовое масло на разлив 1л', 450, 0, 1, 4, 24],
            ['Конопляна олія пляшка 250мл', 'Конопляное масло бутылка 250мл', 166, 0, 250, 3, 25],
            ['Конопляна олія пляшка 500мл', 'Конопляное масло бутылка 500мл', 298, 0, 500, 3, 26],
            ['Конопляна олія на розлив 1л', 'Конопляное масло на разлив 1л', 532, 0, 1, 4, 27],
            ['Кунжутна олія пляшка 250мл', 'Кунжутное масло бутылка 250мл', 172, 0, 250, 3, 28],
            ['Кунжутна олія пляшка 500мл', 'Кунжутное масло бутылка 500мл', 314, 0, 500, 3, 29],
            ['Кунжутна олія на розлив 1л', 'Кунжутное масло на разлив 1л', 566, 0, 1, 4, 30],
            ['Кунжуту чорного олія 250мл', 'Кунжутное масло бутылка 250мл', 178, 0, 250, 3, 31],
            ['Кунжуту чорного олія 500мл', 'Кунжутное масло бутылка 500мл', 330, 0, 500, 3, 32],
            ['Кунжуту чорного на розлив 1л', 'Кунжутное масло на разлив 1л', 608, 0, 1, 4, 33],
            ['Макова олія пляшка 250мл', 'Масовое масло бутылка 250мл', 270, 0, 250, 3, 34],
            ['Макова олія пляшка 500мл', 'Масовое масло бутылка 500мл', 508, 0, 500, 3, 35],
            ['Макова олія на розлив 1л', 'Масовое масло на разлив 1л', 948, 0, 1, 4, 36],
            ['Мигдального горіха олія пляшка 250мл', 'Миндального ореха масло бутылка 250мл', 356, 0, 250, 3, 37],
            ['Мигдального горіха олія пляшка 500мл', 'Миндального ореха масло бутылка 500мл', 688, 0, 500, 3, 38],
            ['Мигдального горіха олія на розлив 1л', 'Миндального ореха масло на разлив 1л', 1324, 0, 1, 4, 39],
            ['Лляна олія пляшка 250мл', 'Льняное масло бутылка 250мл', 86, 0, 250, 3, 40],
            ['Лляна олія пляшка 500мл', 'Льняное масло бутылка 500мл', 142, 0, 500, 3, 41],
            ['Лляна олія на розлив 1л', 'Льняное масло на разлив 1л', 214, 0, 1, 4, 42],
            ['Перцю чілі олія пляшка 50мл', 'Перца чили масло бутылка 50мл', 136, 0, 50, 3, 43],
            ['Перцю чілі олія пляшка 100мл', 'Перца чили масло бутылка 100мл', 234, 0, 100, 3, 44],
            ['Перцю чілі олія на розлив 1л', 'Перца чили масло на разлив 1л', 1552, 0, 1, 4, 45],
            ['Редькова олія пляшка 250мл', 'Редьковое масло бутылка 250мл', 88, 0, 250, 3, 46],
            ['Редькова олія пляшка 500мл', 'Редьковое масло бутылка 500мл', 146, 0, 500, 3, 47],
            ['Редькова олія на розлив 1л', 'Редьковое масло на разлив 1л', 224, 0, 1, 4, 48],
            ['Рижієва олія пляшка 250мл', 'Рыжиковое масло бутылка 250мл', 90, 0, 250, 3, 49],
            ['Рижієва олія пляшка 500мл', 'Рыжиковое масло бутылка 500мл', 148, 0, 500, 3, 50],
            ['Рижієва олія на розлив 1л', 'Рыжиковое масло на разлив 1л', 242, 0, 1, 4, 51],
            ['Розторопшева олія пляшка 250мл', 'Расторопшевое масло бутылка 250мл', 204, 0, 250, 3, 52],
            ['Розторопшева олія пляшка 500мл', 'Расторопшевое масло бутылка 500мл', 382, 0, 500, 3, 53],
            ['Розторопшева олія на розлив 1л', 'Расторопшевое масло на разлив 1л', 712, 0, 1, 4, 54],
            ['Сафлорова олія пляшка 250мл', 'Сафлоровое масло бутылка 250мл', 152, 0, 250, 3, 55],
            ['Сафлорова олія пляшка 500мл', 'Сафлоровое масло бутылка 500мл', 274, 0, 500, 3, 56],
            ['Сафлорова олія на розлив 1л', 'Сафлоровое масло на разлив 1л', 488, 0, 1, 4, 57],
            ['Соєва олія пляшка 250мл', 'Соевое масло бутылка 250мл', 120, 60, 250, 3, 58],
            ['Соєва олія пляшка 250мл', 'Соевое масло бутылка 250мл', 214, 107, 500, 3, 59],
            ['Соєва олія на розлив 1л', 'Соевое масло на разлив 1л', 374, 187, 1, 4, 60],
            ['Соняшникова олія пляшка 250мл', 'Подсолнечное масло бутылка 250мл', 72, 0, 250, 3, 61],
            ['Соняшникова олія пляшка 500мл', 'Подсолнечное масло бутылка 500мл', 120, 0, 500, 3, 62],
            ['Соняшникова олія на розлив 1л', 'Подсолнечное масло на разлив 1л', 186, 0, 1, 4, 63],
            ['Чіа олія пляшка 250мл', 'Чиа масло бутылка 250мл', 216, 108, 250, 3, 64],
            ['Чіа олія пляшка 500мл', 'Чиа масло бутылка 500мл', 404, 108, 500, 3, 65],
            ['Чіа олія на розлив 1л', 'Чиа масло на разлив 1л', 748, 108, 1, 4, 66],
            ['Фундукова олія пляшка 250мл', 'Фундуковое масло бутылка 250мл', 214, 0, 250, 3, 67],
            ['Фундукова олія пляшка 500мл', 'Фундуковое масло бутылка 500мл', 402, 0, 500, 3, 68],
            ['Фундукова олія на розлив 1л', 'Фундуковое масло на разлив 1л', 752, 0, 1, 4, 69],

            // 7 + 3
            ['Конфітюр "Полуниця-м\'ята" 200мл', 'Конфитюр "Клубника-мята" 200мл', 65, 0, 200, 3, 70],
            ['Конфітюр "Абрикос-ром" 200мл', 'Конфитюр "Абрикос-ром" 200мл', 65, 0, 200, 3, 71],
            ['Конфітюр "Груша горчиця та біле вино" 200мл', 'Конфитюр "Груша горчица и белое вино" 200мл', 65, 0, 200, 3, 72],
            ['Конфітюр "Слива-вино-горіх" 200мл', 'Конфитюр "Слива-вино-орех" 200мл', 65, 0, 200, 3, 73],
            ['Конфітюр "Томат-базилік" 200мл', 'Конфитюр "Томат-базилик" 200мл', 65, 0, 200, 3, 74],
            ['Конфітюр "Чорниця с м\'ятой" 200мл', 'Конфитюр "Черника с мятой" 200мл',	75, 0, 200, 3, 75],
            ['Конфітюр "Чорниця-м\'ята" 200мл', 'Конфитюр "Черника-мята" 200мл', 75, 0, 200, 3, 76],
            ['Конфітюр "Ківі-лайм" 200мл', 'Конфитюр "Киви-лайм" 200мл', 79, 0, 200, 3, 77],
            ['Конфітюр "Малина з с перцем чілі" 200мл', 'Конфитюр "Малина с перцем чили" 200мл', 75, 0, 200, 3, 78],
            ['Конфітюр "Малина с ваніллю" 200мл', 'Конфитюр "Малина с ванилью" 200мл', 75, 0, 200, 3, 79],
            ['Конфітюр "Вишня з лимоном" 200мл', 'Конфитюр "Вишня с лимоном" 200мл', 75, 0, 200, 3, 80],
            ['Конфітюр "Іжір з горіхами і вином" 200мл', 'Конфитюр "Ижир с орехами и вином" 200мл', 89, 0, 200, 3, 81],
            ['Мармелад "Глінтвейн" 200мл', 'Мармелад "Глинтвейн" 200мл', 89, 0, 200, 3, 82],
            ['Мармелад з пелюсток троянд 200мл', 'Мармелад из лепестков роз 200мл', 89, 0, 200, 3, 83],
            ['Мармелад "Лимон-імбир" 200мл', 'Мармелад "Лимон-имбирь" 200мл', 75, 0, 200, 3, 84],
            ['Мармелад "Апельсин-лаванда" 200мл', 'Мармелад "Апельсин-лаванда" 200мл', 75, 0, 200, 3, 85],
            ['Мармелад "Апельсин-віскі" 200мл', 'Мармелад "Апельсин-виски" 200мл', 75, 0, 200, 3, 86],
        ];

        $rows = [];
        $time = time();
        foreach ($data as $d) {
            $rows[] = [CH::toSlug($d[0]), $d[0], $d[1], $d[0], $d[1], $d[2], $d[3],
                $d[4], $d[5], $d[6], 1, 1, 1, $time++,
                $d[7]??'', $d[8]??''];
        }

        $this->batchInsert('products', ['slug', 'name_ua', 'name_ru', 'title_ua', 'title_ru', 'price', 'discount',
            'measure', 'unit_id', 'sequence', 'availability', 'recommended', 'status', 'created_at',
            'text_ua', 'text_ru'],
            $rows
        );


    }

    public function safeDown()
    {
        $this->dropTable('products');
    }
}
