<?php

use yii\db\Migration;

class m200408_133607_create_contents_table extends Migration
{
    public function safeUp()
    {
        $this->createTable('contents', [
            'id' => $this->primaryKey()->unsigned(),
            'slug' => $this->string(),

            'name_ua'  => $this->string(191),
            'name_ru'  => $this->string(191),
            'title_ua'  => $this->string(191),
            'title_ru'  => $this->string(191),
            'keywords_ua'  => $this->string(191),
            'keywords_ru'  => $this->string(191),
            'description_ua'  => $this->text(),
            'description_ru'  => $this->text(),
            'text_ua'  => $this->text(),
            'text_ru'  => $this->text(),

            'img'  => $this->text()->comment('src иллюстрации-лого этой категории'),
            'parent_id'  => $this->integer()->unsigned()->defaultValue(0),
            'sequence' => $this->integer()->unsigned()->defaultValue(1),
            'show' => $this->tinyInteger()->unsigned()->defaultValue(1),
            'showmenu' => $this->tinyInteger()->unsigned()->defaultValue(1),

            'created_at' => $this->integer()->unsigned(),
            'updated_at' => $this->integer()->unsigned(),
        ]);

        $this->execute('ALTER TABLE `contents` MODIFY `slug` varchar(255) CHARSET utf8 COLLATE utf8_unicode_ci');
        $this->execute("ALTER TABLE `contents` ADD KEY `str10-contents-slug` (`slug`(10))");

        $time=  time();

        $this->batchInsert('contents', ['slug', 'name_ua', 'name_ru', 'img', 'parent_id', 'sequence', 'show', 'showmenu', 'created_at',
                'text_ua', 'text_ru', 'description_ua', 'description_ru', 'keywords_ua', 'keywords_ru'], [
            ['',            'Головна',          'Главная',          '', 0, 1, 1, 0, $time,
                '“Амбар” - найкраще рішення, коли справа стосується якісного вибору продуктів харчування. Високий сервіс, швидка доставка і безпека на кожному етапі роботи. Довіряючи нам, ви піклуєтеся про благополуччя своїх рідних і близьких!',
                '“Амбар” - лучшее решение, когда дело касается качественного выбора продуктов питания. Высокий сервис, быстрая доставка и безопасность на каждом этапе работы. Доверяя нам, вы заботитесь о благополучии своих родных и близких!',
                '“Амбар” - найкраще рішення, коли справа стосується якісного вибору продуктів харчування.',
                '“Амбар” - лучшее решение, когда дело касается качественного выбора продуктов питания.',
                'Амбар, харчування, продукт, їжа, натуральна',
                'Амбар, питание, продукт, еда, натуральная',
            ],
            ['breakfast',   'Сніданки',         'Завтраки',         '/img/breakfast.png', 0, 2, 1, 1, $time,
                'Погодьтеся, від сніданку залежить те, яким буде весь день. Поїли погано і несмачно - будете півдня думати тільки про їжу і ні на які справи не буде вистачати ні сил, ні енергії. Ми дбаємо про вашу продуктивність, тому розширили асортимент смачними, а найголовніше, корисними сніданками. Мюслі, гранола з різноманітними добавками, пластівці, каші звичайні та швидкого приготування. Ранок стане набагато різноманітнішим, а ваші діти скажуть "спасибі" за такий смачний початок дня. Додайте ще мед і горіхи з нашого каталогу і тоді всі будуть дивуватися вашій неймовірній працездатності.',
                'Согласитесь, от завтрака зависит то, каким будет весь день. Поели плохо и невкусно - будете полдня думать только о еде и ни на какие дела не будет хватать ни сил, ни энергии. Мы заботимся о вашей продуктивности, поэтому расширили ассортимент вкусными, а самое главное, полезными завтраками. Мюсли, гранола с разнообразными наполнителями, хлопья, каши обычные и быстрого приготовления. Утро станет намного разнообразней, а ваши дети скажут “спасибо” за такое вкусное начало дня. Добавьте еще мёд и орехи из нашего каталога и тогда все будут удивляться вашей невероятной работоспособности.',
                'Ми дбаємо про вашу продуктивність, тому розширили асортимент смачними, а найголовніше, корисними сніданками.',
                'Мы заботимся о вашей продуктивности, поэтому расширили ассортимент вкусными, а самое главное, полезными завтраками.',
                'сніданок',
                'завтрак',
            ],
            ['sweet',       'Солодощі',         'Сладости',         '/img/sweet.png', 0, 3, 1, 1, $time,
                'Якщо захотілося чогось до чаю, а полиці шафок спорожніли - не біда. Наш асортимент солодощів порадує найвибагливішого ласуна. Шоколад, цукерки, печиво, зефір - все це ви можете замовити за лічені хвилини. До вас несподівано прийшли гості і ви хочете побалувати їх чимось особливим? В такому випадку, ми пропонуємо широкий вибір тортів, тістечок і бісквітів. Свіжі, духмяні - безсумнівно припадуть до смаку. Також, ми співпрацюємо з українськими бджолярами, завдяки яким, в вашому домі буде завжди корисний, ласий мед.',
                'Если захотелось чего-нибудь к чаю, а полки шкафчиков опустели - не беда. Наш ассортимент сладостей порадует самого привередливого сладкоежку. Шоколад, конфеты, печенье, зефир - всё это вы можете заказать за считанные минуты. К вам неожиданно нагрянули гости и вы хотите побаловать их чем то особенным? В таком случае, мы предлагаем широкий выбор тортов, пирожных и бисквитов. Свежие, ароматные - несомненно придутся по вкусу. Также, мы сотрудничаем с украинскими пасечниками, благодаря которым, в вашем доме будет всегда полезный, лакомый мёд.',
                'Наш асортимент солодощів порадує найвибагливішого ласуна. Шоколад, цукерки, печиво, зефір - все це ви можете замовити за лічені хвилини.',
                'Наш ассортимент сладостей порадует самого привередливого сладкоежку. Шоколад, конфеты, печенье, зефир - всё это вы можете заказать за считанные минуты.',
                'солодощі, мед, шоколад, натуральний',
                'сладости, мёд, шоколад, натуральный',
            ],
            ['cheese',      'Сири',             'Сыры',             '/img/cheese.png', 0, 4, 1, 1, $time,
                'М\'ясо м\'ясом, а ось тарілку смачного сирного асорті ще ніхто не відміняв. Цей делікатес настільки універсальний, що підійде як до келиха терпкого червоного вина, так і до ароматного чорного чаю. У нашому магазині представлені крафтового сири від кращих українських сироварень. Виготовлені виключно із натуральної та екологічної сировини, ці сири додадуть родзинку і неповторний смак до будь-якого застілля. Для знавців та гурманів ми підготували щось особливе - це сири із кмином, журавлиною і козячі сири з різноманітними начинками.',
                'Мясо мясом, а вот тарелку вкусного сырного ассорти еще никто не отменял. Это лакомство настолько универсально, что подойдёт как к бокалу тёрпкого красного вина, так и к ароматному черному чаю. В нашем магазине представлены крафтовые сыры от лучших украинских сыроварень. Приготовленные из исключительно натурального и экологичного сырья, эти сыры привнесут в вашу трапезу изюминку и неповторимый вкус. Для особых гурманов мы приготовили нечто особенное - это сыр с тмином, клюквой и козьи сыры с разнообразными начинками.',
                'Сир настільки універсальний, що підійде як до келиха терпкого червоного вина, так і до ароматного чорного чаю. У нашому магазині представлені крафтового сири від кращих українських сироварень.',
                'Сыр настолько универсален, что подойдёт как к бокалу тёрпкого красного вина, так и к ароматному черному чаю. В нашем магазине представлены крафтовые сыры от лучших украинских сыроварень.',
                'сир, екологічний, натуральный',
                'сыр, экологичный, натуральный',
            ],
            ['sausage',     'Ковбаси',          'Колбасы',          '/img/sausage.png', 0, 5, 1, 1, $time,
                'Ранок, чашка кави, обсмажений тост і, звичайно ж, шматочок свіжої ковбаски. Ми подбали про те, щоб наш асортимент максимально відповідав вашим м\'ясним запитам. Сосиски баварські, з індичкою або телятиною, мюнхенські під холодне пиво і фітнес для спортсменів. Ви поважаєте класику, але полюбляєте смакові експерименти? Тоді для вас у нас є копчені гострі ковбаси, з шматочками сиру і з міксом свинини і баранини. А найголовніше, що вся продукція - локальна і виготовляється виключно зі свіжого м’яса. Від кращих українських виробників з любов\'ю!',
                'Утро, чашечка кофе, обжаренный тост и, конечно же, колечко свежей колбаски. Мы позаботились о том, чтобы наш ассортимент максимально отвечал вашим мясным запросам. Сосиски баварские, с индейкой или телятиной, мюнхенские под холодное пиво и фитнес для спортсменов. Вы уважаете классику, но так же предпочитаете вкусовые эксперименты? Тогда для вас у нас есть копченые острые колбасы, с кусочками сыра и с миксом свинины и баранины. А самое главное, что вся продукция - локальная и основным компонентом всегда является свежее мясо. От лучших украинских производителей с любовью!',
                'Ми подбали про те, щоб наш асортимент максимально відповідав вашим м\'ясним запитам. Сосиски баварські, з індичкою або телятиною, мюнхенські під холодне пиво і фітнес для спортсменів.',
                'Мы позаботились о том, чтобы наш ассортимент максимально отвечал вашим мясным запросам. Сосиски баварские, с индейкой или телятиной, мюнхенские под холодное пиво и фитнес для спортсменов.',
                'ковбаси, сосиски баварські, з індичкою, з телятиною, дієтичні',
                'колбасы, сосиски баварские, мюнхенские, с индейкой, с телятиной, диетические',
            ],
            ['snacks',      'Снеки',            'Снеки',            '/img/snacks.png', 0, 6, 1, 1, $time,
                'Вже давним давно дієтологами доведено, що перекус - це такий же важливий прийом їжі як сніданок або вечеря. У нашому магазині можна замовити снеки на будь-який смак і під будь-який привід. Перегляд з сім\'єю нового фільму - чіпси, попкорн; зібралися з друзями на пиво - в\'ялена рибка, сухарики, смажене насіння. І звичайно, ми не забуваємо про тих, хто стежить за фігурою, займається спортом і віддає перевагу більш здоровим перекусам. Зверніть увагу на цільнозернові, протеїнові батончики, сухофрукти та горішки.',
                'Уже давным давно диетологами доказано, что перекус - это такой же важный приём пищи как завтрак или ужин. В нашем магазине можно заказать снеки на любой вкус и повод. Просмотр с семьёй нового фильма - чипсы, попкорн; собрались с друзьями на пиво - вяленая рыбка, сухарики, семечки. И конечно, мы не забываем про тех, кто следит за фигурой, занимается спортом и предпочитает более здоровые перекусы. Обратите внимание на цельнозерновые, протеиновые батончики, сухофрукты и орешки. ',
                'У нашому магазині можна замовити снеки на будь-який смак і під будь-який привід. Перегляд з сім\'єю нового фільму - чіпси, попкорн; зібралися з друзями на пиво - в\'ялена рибка, сухарики, смажене насіння.',
                'В нашем магазине можно заказать снеки на любой вкус и повод. Просмотр с семьёй нового фильма - чипсы, попкорн; собрались с друзьями на пиво - вяленая рыбка, сухарики, семечки.',
                'снек, перекус, чіпси, попкорн, в\'ялена риба, сухарики, смажене насіння',
                'снек, перекус, чипсы, попкорн, вяленая рыбка, сухарики, жареные семечки',
            ],
            ['sauce',       'Соуси',            'Соусы',            '/img/sauce.png', 0, 7, 1, 1, $time,
                'Адже погодьтеся, яким би апетитним не був на столі шашлик, чи якою б ароматною зі скоринкою не вийшла ваша фарширована риба - руки завжди тягнуться до соусу. І ми ж не будемо відмовляти собі у задоволенні приготувати салат Олів\'є і тому обов\'язково додамо у замовлення такий улюблений майонез, гірчицю і кетчуп. Не забудьте також про соєвий соус, песто, хрін і томатну пасту. Разом набагато смачніше. І обов\'язково зверніть увагу на салатні заправки. З ними ваш Цезар та Грецький будуть смачніше ніж в ресторані.',
                'Ведь согласитесь, какой бы аппетитный не оказался на столе шашлык или ароматная с корочкой фаршированная рыба - рука всегда тянется за соусом. И мы ведь не будем отказывать себе в приготовлении салата Оливье и обязательно добавим в заказ такой любимый майонез, горчицу и кетчуп. Не забудьте также про соевый соус, песто, хрен и томатную пасту. Вместе же намного вкуснее. И обязательно обратите внимание на салатные заправки. С ними ваш Цезарь и Греческий  будут намного вкуснее ресторанных.',
                'І ми не будемо відмовляти собі у задоволенні приготувати салат Олів\'є і тому обов\'язково додамо у замовлення такий улюблений майонез, гірчицю і кетчуп. Не забудьте також про соєвий соус, песто, хрін і томатну пасту.',
                'И мы не будем отказывать себе в приготовлении салата Оливье и обязательно добавим в заказ такой любимый майонез, горчицу и кетчуп. Не забудьте также про соевый соус, песто, хрен и томатную пасту.',
                'соус, майонез, кетчуп, песто, хрін, томатна паста',
                'соус, майонез, кетчуп, песто, хрен, томатная паста',
            ],
            ['frozen',      'Заморожене',       'Замороженное',     '/img/frozen.png', 0, 8, 1, 1, $time,
                'У нашому магазині представлений широкий вибір замороженої продукції: риба, м\'ясо і птиця, морепродукти, овочі і гриби, напівфабрикати, піца і тісто. Ми відповідаємо за якість продуктів, які пройшли процес заморозки і гарантуємо, що на вашому столі буде все тільки найсвіжіше. Особливість доставки такого виду продукції нашим магазином полягає в тому, що ми використовуємо спеціальні термопакети, що підтримують низьку температуру. Важливу роль відіграє і швидкість доставки, тому ми обмежили її радіус, але, тим самим, дали вам можливість отримувати замовлення швидко.',
                'В нашем магазине представлен широкий выбор замороженной продукции: рыба, мясо и птица, морепродукты, овощи и грибы, полуфабрикаты, пицца и тесто. Мы отвечаем за качество продуктов, которые прошли процесс заморозки и гарантируем, что к вам на стол попадёт всё только самое свежее. Особенность доставки такого вида продукции нашим магазином заключается в том, что мы используем специальные термопакеты, поддерживающие низкую температуру. Немаловажную роль играет и скорость доставки, поэтому мы ограничили её радиус, но, тем самым, дали вам возможность получать заказы быстро.',
                'У нашому магазині представлений широкий вибір замороженої продукції: риба, м\'ясо і птиця, морепродукти, овочі і гриби, напівфабрикати, піца і тісто.',
                'В нашем магазине представлен широкий выбор замороженной продукции: рыба, мясо и птица, морепродукты, овощи и грибы, полуфабрикаты, пицца и тесто.',
                'заморожені риба, м\'ясо і птиця, морепродукти, овочі і гриби, напівфабрикати, піца і тісто',
                'замороженные рыба, мясо и птица, морепродукты, овощи и грибы, полуфабрикаты, пицца и тесто',
            ],
            ['drinks',      'Напої',            'Напитки',          '/img/drinks.png', 0, 9, 1, 1, $time,
                'Жоден прийом їжі, як втім і жоден день в житті людини, не обходиться без рідини. Вгамувати спрагу після пробіжки, побалувати малюка смачним соком, запити бабусин пиріжок холодної газованою водою або насолодитись келихом ігристого з коханим. Цілі можуть бути різні, а варіант їх досягнення - один. У нас в магазині можна замовити абсолютно будь-який напій, не залежно від приводу. Окремо варто відзначити колекцію алкоголю за доступними цінами і, звичайно ж, не забувайте про чай, каву та какао.',
                'Ни один приём пищи, как впрочем и ни один день в жизни человека, не обходится без жидкости. Утолить жажду после пробежки, побаловать малыша вкусным соком, запить бабушкин пирожок холодной газировкой или насладится бокалом игристого с любимым. Цели могут быть разные, а вариант достижения - один. У нас в магазине можно заказать абсолютно любой напиток, не зависимо от повода. Отдельно стоит отметить коллекцию алкоголя по доступным ценам и, конечно же, не забывайте про чай, кофе и какао.',
                'У нас в магазині можна замовити абсолютно будь-який напій, не залежно від приводу. Окремо варто відзначити колекцію алкоголю за доступними цінами і, звичайно ж, не забувайте про чай, каву та какао.',
                'У нас в магазине можно заказать абсолютно любой напиток, не зависимо от повода. Отдельно стоит отметить коллекцию алкоголя по доступным ценам и, конечно же, не забывайте про чай, кофе и какао.',
                'напій, алкоголь, чай, кава, какао, вино',
                'напиток, алкоголь, чай, кофе, вино',
            ],
            ['about',       'Про нас',          'О нас',            '', 0, 10, 1, 0, $time,
                'Ми не просто магазин продуктів харчування. Ми - велика спільнота, де продавець стежить за якістю і високим рівнем сервісу, а покупець піклується про здоров\'я своєї родини і цінує кожну хвилину життя. Ми підтримуємо і поважаємо один одного.

Нам важливо, щоб на вашому столі були завжди свіжі смачні продукти, які принесуть користь не тільки організму, але і створять привід зібратися друзями і продегустувати крафтові сири або позмагатися в смаженні ковбасок.

Щоб якомога частіше оновлювати наш асортимент, ми співпрацюємо з місцевими виробниками і фермерами, які не перестають дивувати своїми вміннями та ідеями. Чи знали ви, що в Київській області вирощують французьких племінних кіз, а з їх молока виробляють сири, йогурти, сметану? А щоб спробувати Пармезан чи Рікотту зовсім не потрібно їхати в Італію. Можливо, ви чуєте про це вперше, тому, ми вважаємо нашим обов\'язком познайомити вас з цією та іншою продукцією, повний перелік якої ви знайдете на нашому сайті.

Будьте здорові та смачного!',
                'Мы не просто магазин продуктов питания. Мы - большое сообщество, где продавец следит за качеством и надлежащем сервисом, а покупатель заботится о здоровье своей семьи и дорожит каждой минутой. Мы поддерживаем и ценим друг друга. 

Нам важно, чтобы на вашем столе были всегда свежие вкусные продукты, которые принесут пользу не только организму, но и создадут повод собраться друзьями и продегустировать крафтовые сыры или посоревноваться в жарке колбасок. 

Чтобы как можно чаще обновлять наш ассортимент, мы сотрудничаем с местными производителями и фермерами, которые не перестают удивлять своими умениями и идеями. Знали ли вы, что в Киевской области выращивают французских племенных коз, а из их молока производят сыры, йогурты, сметану? А чтобы попробовать Пармезан и Рикотту не обязательно ехать в Италию. Возможно, вы слышите об этом впервые, поэтому, мы считаем нашим долгом познакомить вас с этой и другой продукцией, полный перечень которой вы найдёте на нашем сайте.

Будьте здоровы и приятного вам аппетита!',
                'Нам важливо, щоб на вашому столі були завжди свіжі смачні продукти, які принесуть користь не тільки організму, але і створять привід зібратися друзями і продегустувати крафтові сири або позмагатися в смаженні ковбасок.',
                'Нам важно, чтобы на вашем столе были всегда свежие вкусные продукты, которые принесут пользу не только организму, но и создадут повод собраться друзьями и продегустировать крафтовые сыры или посоревноваться в жарке колбасок. ',
                '',
                '',
            ],
            ['delivery',    'Доставка та оплата', 'Доставка и оплата', '', 0, 12, 1, 0, $time,
                'Оформити замовлення ви можете за вказаним номером телефону або через корзину на сайті. Ми працюємо для вас кожен день з 10:00 - 23:00. Для того, щоб ви отримували замовлення швидко, незалежно від завантаженості міста і погодних умов, ми обмежили радіус доставки до 2 км від фізичного магазину. При оформленні ви вказуєте адресу та зручний для вас час отримання замовлення і наш кур\'єр доставить його вам. Вартість доставки - 5о грн. При замовленні товарів більш ніж на 500 грн - доставка безкоштовна.

Всі покупки ми охайно складаємо в пакети і обов\'язково враховуємо товарне сусідство: різні категорії запаковуються окремо один від одного.

Замовляючи алкогольні напої будьте, будь ласка, готові пред\'явити при отриманні товару документи, які підтвердять, що вам вже виповнилося 18 років.

Оплатити замовлення ви можете за допомогою кредитної картки онлайн або ж готівкою нашому кур\'єрові - від нього ви отримаєте фіскальний чек з нашого магазину, який підтверджує вартість товарів.

Обов\'язково перевірте ваше замовлення в присутності кур\'єра, особливо товари категорії "суперфреш": ковбаси, сири і т.д., які згодом поверненню не підлягають. Якщо при отриманні доставки ви виявили товар з вадою або ж позицію, якої не було у вашому замовленні, ви можете оформити відмову. Відповідно до Закону України про захист прав споживачів повернути гроші або зробити обмін ви можете тільки при збереженні чека і наявності сумнівного товару.

Увага! Ми шануємо кожного нашого покупця і ретельно піклуємося про його здоров\'я. Всі співробітники нашого магазину особливо ті, хто безпосередньо займається пакуванням і доставкою ваших замовлень, пройшли повне медичне обстеження, користуються захисними масками, рукавичками та слідують всім необхідним правилам гігієни. Ваша безпека - наш головний пріоритет!',
                'Оформить заказ вы можете по указанному номеру телефона или через корзину на сайте. Мы работаем для вас каждый день с 10:00 - 23:00. Для того, чтобы вы получали заказы быстро, вне зависимости от загруженности города и погодных условий, мы ограничили радиус доставки до 2 км от физического магазина. При оформлении вы указываете адрес и удобное для вас время получение заказа и наш курьер доставит его вам. Стоимость доставки - 5о грн. При заказе товаров более чем на 500 грн -  доставка бесплатная.

Все покупки мы аккуратно складываем в пакеты и обязательно учитываем товарное соседство: разные категории упаковываются отдельно друг от друга. 

Заказывая алкогольные напитки будьте, пожалуйста, готовы предъявить при получении товара документы подтверждающие, что вам уже исполнилось 18 лет.

Оплатить заказ вы можете кредитной картой онлайн или же наличными нашему курьеру - от него вы получите фискальный чек из нашего магазина, подтверждающий стоимость товаров.

Обязательно проверьте ваш заказ в присутствии курьера, особенно товары категории “суперфреш”: колбасы, сыры и т.д., которые впоследствии возврату не подлежат. Если при получении доставки вы обнаружили товар с изъяном или же позицию, которой не было в вашем заказе, вы можете оформить отказ. Согласно Закону Украины о защите прав потребителей вернуть деньги или совершить обмен вы можете только при сохранении чека и наличии сомнительного товара.

Внимание! Мы дорожим каждым нашим покупателем и тщательно заботимся о его здоровье. Все сотрудники нашего магазина в особенности те, кто непосредственно занимается сборкой и доставкой ваших заказов, прошли полное медицинское обследование, пользуются защитными масками, перчатками и следуют всем необходимым правилам гигиены. Ваша безопасность - наш главный приоритет!',
                'Оформити замовлення ви можете за вказаним номером телефону або через корзину на сайті. Ми працюємо для вас кожен день з 10:00 - 23:00.',
                'Оформить заказ вы можете по указанному номеру телефона или через корзину на сайте. Мы работаем для вас каждый день с 10:00 - 23:00.',
                '',
                '',
            ],
            ['news',        'Новини',           'Новости',          '', 0, 13, 1, 0, $time,
                '',
                '',
                '',
                '',
                '',
                '',
            ],
            ['article',    'Статті',           'Статьи',           '', 0, 14, 1, 0, $time,
                '',
                '',
                '',
                '',
                '',
                '',
            ],
            ['contacts',    'Контакти',         'Контакты',         '', 0, 15, 1, 0, $time,
                '',
                '',
                '',
                '',
                '',
                '',
            ],
            /*['rules',       'Правила',          'Правила',          '', 0, 11, 1, 0, $time,
                '',
                '',
                '',
                '',
                '',
                '',
            ],*/
        ]);
    }

    public function safeDown()
    {
        $this->dropTable('contents');
    }
}
